{"id": 4, "authors": ["Diane Bartz"], "date_publish": "03/23/2022", "description": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died on Wednesday at the age of 84.", "filename": "https%3A%2F%2Fwww.reuters.com%2Fworld%2Fus%2Fformer-us-secretary-state-madeleine-albright-has-died-family-2022-03-23%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.reuters.com", "leaning": 3, "title": "Madeleine Albright, former U.S. secretary of state and feminist icon, dies at 84", "maintext": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died on Wednesday at the age of 84.\nHer family announced her death on Twitter and said she had died of cancer. Leaders, diplomats and academics remembered her as a trailblazer on the world stage.\nAlbright served as U.S. ambassador to the United Nations from 1993-1997 in U.S. President Bill Clinton's administration. He then nominated her to become the first female secretary of state and she served in that role from 1997-2001.\n\"Madeleine Albright was a force. She defied convention and broke barriers again and again,\" U.S. President Joe Biden said. He directed U.S. flags be flown at half-staff at the White House and government buildings, including embassies, until March 27.\nShe was a tough-talking diplomat in an administration that hesitated to involve itself in the two biggest foreign policy crises of the 1990s - the genocides in Rwanda and Bosnia-Herzegovina.\nShe once upset a Pentagon chief by asking why the military maintained more than 1 million men and women under arms if they never used them.\nThe plain-spoken Albright took a tough line on a 1996 incident where Cuban jet fighters downed two unarmed U.S.-based planes, saying: \"This is not cojones, this is cowardice,\" using a Spanish vulgarity meaning \"testicles.\"\nWhile at the United Nations, where Security Council members stood in silence on Wednesday to honor her memory, she pressed for a tougher line against the Serbs in Bosnia after Bosnian Serb military forces laid siege to the capital Sarajevo.\nDuring Clinton's first term, many of his administration's top foreign policy experts did not want to get involved because they vividly remembered how the United States became bogged down in Vietnam.\nIn 1995, Bosnian Serb soldiers overran three Moslem enclaves, Srebrenica, Gorazde and Zepa, and massacred more than 8,000 people.\nThe United States responded by working with NATO on airstrikes that forced an end to the war but only after it had been going on for three years.\nAlbright's experience as a refugee prompted her to push for the United States to use its superpower clout. She wanted a \"muscular internationalism,\" said James O'Brien, a senior adviser to Albright during the Bosnian war.\nEarly in the Clinton administration, while she unsuccessfully advocated for a quicker, stronger response in Bosnia, Albright backed a U.N. war crimes tribunal that eventually put the architects of that war, including Serbian President Slobodan Milosevic and Bosnian Serb leaders, in jail, O'Brien said.\nThe painful lessons learned in Rwanda and Bosnia served the United States well in Kosovo, when Washington saw the more powerful Serbs begin a program of ethnic cleansing of ethnic Albanians. NATO responded with an 11-week campaign of air strikes in 1999 that extended to Belgrade.\nKosovo President Vjosa Osmani said on Wednesday she was “deeply shocked by the loss of Kosovo's great friend,” adding that the intervention \"gave us hope, when we did not have it.\"\nDuring efforts to press North Korea to end its nuclear weapons program, which were eventually unsuccessful, Albright traveled to Pyongyang in 2000 to meet North Korean leader Kim Jong-il, becoming the highest ranking U.S. official to visit the secretive Communist-run country at the time.\n1/8 Former U.S. Secretary of State Madeleine Albright speaks before an interview in Washington, U.S., November 28, 2016. Picture taken November 28, 2016.\nFEMINIST HEROINE\nOnce the Clinton years and the 1990s were over, Albright became an icon to a generation of young women looking for inspiration in their quest for opportunity and respect in the workplace. Albright was fond of saying: \"There's a special place in hell for women who don't help each other.\"\nAlbright was a marked contrast to her predecessors and male colleagues in uniform suits. She used clothes and jewelry to send tart, political messages. One favorite was a snake brooch, a reference to Iraqi leader Saddam Hussein calling her an \"unparalleled serpent.\"\nShe wrote a book about her signature jewelry, one of several bestsellers, explaining that the pins were a diplomatic tool. Balloons or flower pins would indicate she felt optimistic, while a crab or turtle would indicate frustration.\nBorn Marie Jana Korbelova in Prague on May 15, 1937, her family fled in 1939 to London when Germany occupied Czechoslovakia. She attended school in Switzerland at age 10 and adopted the name Madeleine.\nShe was raised a Roman Catholic but after she became secretary of state, the Washington Post dug up documentation showing that her family was Jewish and relatives, including three grandparents, died in the Holocaust. Her parents likely converted to Catholicism from Judaism to avoid persecution as Nazism gained strength in Europe, the paper reported.\nAfter the war, the family left London and returned to Czechoslovakia, then in the throes of a communist takeover.\nHer father, a diplomat and academic who opposed communism, moved the family to the United States where he taught international studies at the University of Denver. One of his favorite students was Condoleezza Rice, who would become the second female secretary of state in 2005 under Republican President George W. Bush.\n\"It is quite remarkable that this Czech émigré professor has trained two secretaries of state,\" Albright told the New York Times in 2006.\nAlbright attended Wellesley College in Massachusetts, and got a doctorate from Columbia University. She became fluent or close to it in six languages including Czech, French, Polish and Russian as well as English.\nIn 1959, she married newspaper heir Joseph Medill Patterson Albright, whom she met while working at the Denver Post, and they had three daughters. They divorced in 1982.\nShe followed her father into academia but also became involved in Democratic Party politics. Albright joined the staff of Senator Edmund Muskie, a Maine Democrat, in 1976 and two years later became a member of President Jimmy Carter's National Security Council staff.\nSince leaving the Clinton administration, she has written a series of books. One, \"Hell and Other Destinations,\" was published in April 2020. Others include her autobiography, \"Madam Secretary: A Memoir\" (2003) and \"Read My Pins: Stories from a Diplomat’s Jewel Box\" (2009).\nThe plain-spoken Albright made forays into popular culture. \"Parks and Recreation\" star Amy Poehler's character had a picture of Albright in her office.\nIn 2005, the \"Gilmore Girls\" television series the character Rory dreamt that Albright, wearing a red suit and an eagle pin, was her mother.\nIn 2018, she and fellow former secretaries of state Colin Powell and Hillary Clinton briefed a fictional secretary of state in \"Madam Secretary,\" a TV drama where she spoke passionately about the dangers of abusive nationalism.", "url": "https://www.reuters.com/world/us/former-us-secretary-state-madeleine-albright-has-died-family-2022-03-23/?utm_source=ground.news&utm_medium=referral"}