{"id": 5, "authors": [], "date_publish": "03/22/2022", "description": "Police are investigating 12 gatherings held at Downing Street after an internal inquiry found Johnson's staff had enjoyed alcohol-fuelled parties, with the British leader attending a few of the events himself", "filename": "https%3A%2F%2Fwww.news18.com%2Fnews%2Fworld%2Fbritish-police-begin-interviews-over-lockdown-downing-street-party-investigation-4895282.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.news18.com", "leaning": 4, "title": "British Police Begin Interviews Over Lockdown Downing Street Party Investigation", "maintext": "Police have begun to interview witnesses as part of their investigation into alleged breaches of lockdown rules at gatherings in British Prime Minister Boris Johnson’s office and residence, the Metropolitan Police said on Monday.\nPolice are investigating 12 gatherings held at Downing Street after an internal inquiry found Johnson’s staff had enjoyed alcohol-fuelled parties, with the British leader attending a few of the events himself.\n“Detectives investigating allegations of breaches of Covid-19 regulations in Downing Street and Whitehall have begun to interview people, as witnesses, as part of their ongoing enquiries,\" the Met said in a statement.\nThe police said over 100 questionnaires had been sent out as part of the investigation, with initial responses helping to identify further individuals who had now also been sent questionnaires.\nJohnson is among those to have received a questionnaire about the gatherings, which took place at time many people could not attend funerals or say farewell to loved ones dying in hospital due to strict COVID-19 lockdown rules.\nAdvertisement\nThe revelations sparked widespread anger, and some politicians in the prime minister’s own party joined the opposition in calling for him to quit.\nHowever, as focus has shifted to Russia’s invasion of Ukraine, some, such as the Conservative leader in Scotland Douglas Ross, have withdrawn that call, saying the focus should be on the war.\nThe police said it had not yet referred any individuals for a fixed penalty notice, which would be issued to people deemed to have broken COVID rules.\nIt said that the investigation was proceeding as quickly as possible but gave no time frame for its completion.\nRead all the Latest News , Breaking News and Ukraine-Russia War Live Updates here.", "url": "https://www.news18.com/news/world/british-police-begin-interviews-over-lockdown-downing-street-party-investigation-4895282.html?utm_source=ground.news&utm_medium=referral"}