{"id": "5", "authors": ["Sheila Mulrooney Eldred"], "date_publish": "11/12/21", "description": "Does a booster shot mean that you can return to your old normal? Or is there still a newish kind of normal to face?", "filename": "https%3A%2F%2Fwww.npr.org%2Fsections%2Fgoatsandsoda%2F2021%2F11%2F12%2F1055145678%2Fcoronavirus-faq-i-just-got-a-booster-can-i-go-crazy.json", "image_url": null, "topic": ["vaccine"], "source_domain": "www.npr.org", "leaning": 3, "title": "Goats and Soda : NPR", "maintext": "Coronavirus FAQ: I just got a booster. Can I go back to my pre-pandemic routines?\nEach week, we answer frequently asked questions about life during the coronavirus crisis. If you have a question you'd like us to consider for a future post, email us at goatsandsoda@npr.org with the subject line: \"Weekly Coronavirus Questions.\" See an archive of our FAQs here.\nMy turn for a booster is coming up! After I get my shot, can I go crazy and leave my mask at home, or do I still need to take all the same precautions?\nEnlarge this image toggle caption Lev Radin/Pacific Press/LightRocket via Ge Lev Radin/Pacific Press/LightRocket via Ge\nWith more Americans getting COVID-19 boosters these days than first shots and many more potentially becoming eligible as the FDA is currently considering Pfizer's request to approve its booster for the general population, the number of people enjoying boosted vaccine status is skyrocketing.\nBut what does that new status buy you, exactly? We spoke to Charlotte Baker, assistant professor of epidemiology at Virginia Tech, and Abraar Karan, an infectious disease doctor at Stanford University, to find out.\nWhat a booster means, they say, is that you've got your best layer of protection — your vaccine — back in prime condition. Recent research has shown that vaccines wane after time (for example, a recent study found Pfizer dropped from 90% effective at preventing symptomatic infection initially to 70% after five months), but that boosters work well at increasing your antibody protection. (Note that you still must wait until after that 2-week point waiting period — just like the first time around, our experts stress, your new jab won't reach peak effectiveness until about two weeks later.)\nBut even after that, Baker and Karan urge you to keep your stash of masks. And definitely do not stop washing your hands! With cold and flu season ramping up, wearing a mask when you're out and about can protect you from a variety of germs. In fact, after your booster, you may be more at risk of catching a cold or flu than COVID-19.\n\"It's still the same precautions, but the fact is that you have just improved your immunity,\" Baker says. \"So if you're somebody who is not really high risk, you can feel a little bit better about your chances of contracting COVID.\"\nMore good news: There's no reason to stay in lockdown mode, Baker says. If you're booster-protected and healthy enough that the flu wouldn't present a grave risk and raring to go out, go for it.\n\"If you're thinking, 'OK, I kinda wanna start to get back out there in the world a little bit.' I don't see a problem with that,\" Baker says.\nWhile that may not sound like a ringing endorsement, even Baker herself, who has been extremely cautious during the pandemic, booked a reservation for dinner recently. Depending on your level of risk tolerance, you can look for restaurants that are taking precautions such as physical distancing, patio dining, mask requirements when not actively eating. Or avoid crowds by going during off-peak hours, she suggests.\nYou can take similar precautions at gyms and movie theaters; going at off-peak times can make an especially big difference in the number of people – and the level of risk.\n\"The bottom line is, we're not in lockdown anymore,\" she says. And your mental health needs are important, too, especially if you've already spent significant portions of the pandemic separated from loved ones. \"If you wanna go out, go out. Just be safe about it.\"\nThat also means staying on top of local data, she and Karan point out.\n\"If you have low rates of spread [in your area] and are fully boosted, I think you can consider it unlikely that you'll get COVID-19, Karan says. \"If the rates are high, then of course there's still a chance ... but you'll be exceedingly unlikely to get severe disease.\"\n(For help weighing your risks, refer to our questionnaire.)\nIf you do find out you've come in contact with someone who turned out to be infected, people with boosters should follow the same CDC guidance they did before: Get tested five to seven days after the exposure.\nReady to roll up your sleeve again? You may not have long to wait: Boosters for all vaccinated Americans 18 and older may be here by Thanksgiving.\nSheila Mulrooney Eldred is a freelance health journalist in Minneapolis. She's written about COVID-19 for many publications, including The New York Times, Kaiser Health News, Medscape and The Washington Post. More at sheilaeldred.pressfolios.com. On Twitter: @milepostmedia", "url": "https://www.npr.org/sections/goatsandsoda/2021/11/12/1055145678/coronavirus-faq-i-just-got-a-booster-can-i-go-crazy"}