{"id": 2, "authors": ["Simon Kent"], "date_publish": "03/23/2022", "description": "Biotech company Moderna is approaching the Food and Drug Administration (FDA) for emergency use authorization to vaccinate young children.", "filename": "https%3A%2F%2Fwww.breitbart.com%2Fhealth%2F2022%2F03%2F23%2Fmoderna-seeks-urgent-approval-to-vaccinate-very-young-children%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.breitbart.com", "leaning": 5, "title": "Moderna Seeks Urgent Approval to Vaccinate Young Children", "maintext": "Biotech company Moderna announced Wednesday it is approaching the Food and Drug Administration (FDA) for emergency use authorization to enable coronavirus vaccinations to be administered to very young children, those aged between six months and six years of age included.\nModerna’s vaccine is currently only approved for those over 18 years old, while Pfizer-BioNTech’s is approved for adults and has emergency use authorization for those between ages five and 18.\nTime Magazine reports in addition to seeking authorization for its vaccine to be used for children between six months and six years of age, Moderna is also asking the FDA to authorize two doses of its mRNA vaccine in children six to 12 years old, based on data provided to the agency the shots are safe and effective in that age group.\nThe company’s KidCOVE study will be submitted to the FDA to back its request.\nIn the study, nearly 7,000 children six months to six years old were randomly assigned to receive two doses of Moderna’s mRNA-based COVID-19 vaccine, or two doses of placebo. TIME then details further:\nThe dosage for this age group is one-quarter of that currently approved for adults. Children vaccinated with the shot produced antibodies against SARS-CoV-2 at similar levels to those that adults made after being vaccinated at higher doses, likely reflecting children’s more active and efficient immune systems. Those antibodies led to an efficacy of 43.7% in protecting children six months to two years old from getting infected with the Omicron variant of the COVID-19 virus, and 37.5% among those aged two to six. None of the children in the study who became infected experienced severe disease, were hospitalized, or died.\nTIME reports the new Omicron subvariant, BA.2, continues to cause more new infections, and virus control measures like mask-wearing are being dropped in schools and other public places throughout the U.S..", "url": "https://www.breitbart.com/health/2022/03/23/moderna-seeks-urgent-approval-to-vaccinate-very-young-children/?utm_source=ground.news&utm_medium=referral"}
