{"id": 5, "authors": ["Jon Brown"], "date_publish": "03/23/2022", "description": "Former Secretary of State Madeleine Albright died Wednesday, according to an announcement from her family.", "filename": "https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Fmadeleine-albright-dies%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.foxnews.com", "leaning": 5, "title": "Madeleine Albright dies of cancer at 84", "maintext": "Former Secretary of State Madeleine Albright died Wednesday, according to an announcement from her family.\n\"We are heartbroken to announce that Dr. Madeleine K. Albright, the 64th U.S. Secretary of State and the first woman to hold that position, passed away earlier today. The cause was cancer. She was surrounded by family and friends. We have lost a loving mother, grandmother, sister, aunt, and friend,\" her family said in a statement.\nThey went on to describe her as \"a tireless champion of democracy and human rights.\"\nBorn Marie Jana Korbel on May 15, 1937, Albright immigrated to the United States from Czechoslovakia with her family in 1948 following a communist coup. Her family was Jewish and converted to Roman Catholicism when she was five years old. Three of her Jewish grandparents died in concentration camps.\nAlbright said she did not learn of her family's Jewish heritage until after becoming secretary of state.\nAfter graduating from Wellesley College in 1959, she went on to earn her PhD from Columbia University in 1975. She worked for former Sen. Edmund Muskie and later with Zbigniew Brzezinski on the National Security Council during the Carter administration.\nShe later served in the administration of former President Bill Clinton, first as U.S. ambassador to the United Nations and then as secretary of state during his second term. As secretary of state, she played a role in urging the Senate to ratify expansion of NATO into former Soviet nations and secure nuclear non-proliferation agreements.\nShe also helped convince Clinton to go to war against the Yugoslav leader Slobodan Milosevic because of how Kosovar Albanians were being treated in 1999.\nFollowing her service in the Clinton administration, she remained outspoken and critical of the Bush administration's foreign policy following 9/11.\nIn 2012, she was given the Presidential Medal of Freedom from former President Barack Obama.\nAt the time of her death, she was a professor at Georgetown University's School of Foreign Service, as well as chair of Albright Stonebridge Group. She also wrote several books.\n\"Hillary and I are profoundly saddened by the passing of Madeleine Albright,\" Clinton said in statement. \"She was one of the finest Secretaries of State, an outstanding UN Ambassador, a brilliant professor, and an extraordinary human being.\n\"Few leaders have been so perfectly suited for the times in which they served,\" he added.\n\"I will always be deeply grateful for the wonderful friendship Bill and I shared with [Albright] and the unfailingly wise counsel she gave us over so many years,\" tweeted Hillary Clinton. \"So many people around the world are alive and living better lives because of her service.\"\n\"The impact that she has had on this building is felt every single day in just about every single corridor,\" said State Department spokesperson Ned Price. \"Of course, she was a trailblazer as the first female secretary of state and quite literally opened doors for a large element of our workforce.", "url": "https://www.foxnews.com/politics/madeleine-albright-dies?utm_source=ground.news&utm_medium=referral"}