{"id": 7, "authors": [""], "date_publish": "02/02/2022", "description": "SpaceX's Elon Musk said Thursday that the first orbital flight of his towering Starship could come soon. NASA plans to use the fully reusable Starship to land astronauts on the moon as early as 2025.", "filename": "https%3A%2F%2Fwww.npr.org%2F2022%2F02%2F11%2F1080046477%2Fspacexs-elon-musk-says-1st-orbital-starship-flight-could-be-as-early-as-march%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["technology"], "source_domain": "www.npr.org", "leaning": 3, "title": "First orbital SpaceX Starship flight could come by March", "maintext": "SpaceX's Elon Musk says 1st orbital Starship flight could be as early as March\n— SpaceX's Elon Musk said Thursday that the first orbital flight of his towering Starship — the world's most powerful rocket ever built — could come in another month or two.\nWhile he anticipates failures, he's confident Starship will reach orbit by the end of this year.\nMusk provided his first major Starship update in more than two years while standing alongside the 390-foot rocket at SpaceX's Texas spaceport. He urged the nighttime crowd, \"Let's make this real!\"\n\"This is really some wild stuff here,\" he said. \"In fact, hard to believe it's real.\"\nNASA plans to use the fully reusable Starship to land astronauts on the moon as early as 2025. Musk, meanwhile, hopes to deploy a fleet of Starships to create a city on Mars, hauling equipment and people there.\nFor now, the initial flights would carry Musk's internet satellites, called Starlinks, into orbit.\n\"There will probably be a few bumps in the road, but we want to iron those out with satellite missions and test missions\" before putting people on board, he said.\nSpaceX's Super Heavy first-stage booster has yet to blast off. But the futuristic, bullet-shaped, steel Starship — perched on top and serving as the upper stage — successfully launched and landed on its own last May, following a series of spectacular explosions. The rocketship soared more than 6 miles.\nSpaceX is awaiting approval from the Federal Aviation Administration before proceeding with Starship's next phase: going into orbit. Musk said he expects the go-ahead in March and that the rocket should be ready to fly by then as well. That would put the launch in the next couple of months, he added.\nIf the FAA demands more information about potential environmental impacts or lawsuits emerge, Musk said Starship launches could move to NASA's Kennedy Space Center in Florida. But that would delay the first orbital launch by more than half a year, he noted.\nThe full-size Starships are massive — taller than NASA's past and present moon rockets, with approximately double the liftoff thrust.\nBesides Florida's Cape Canaveral and the southern tip of Texas near Boca Chica, Starships could ultimately launch from floating ocean platforms anywhere in the world, Musk said. He envisions Starships launching three times a day — \"rapid reusability\" — with refilling stations in space for the longer destinations like Mars. The first refilling test could happen by the end of next year, he said.\nMusk estimates a Starship launch could wind up costing less than $10 million — maybe even just a few million dollars with a high flight rate, which would bring down prices. He called it \"crazy low\" and \"ridiculously good\" by current space standards.\nStarship already has one private customer: a Japanese entrepreneur who has bought a flight around the moon and plans to take a dozen artists with him. Musk hinted there are others interested in buying trips, saying future announcements would be forthcoming.\nUntil now, SpaceX has relied on its much smaller Falcon rockets to launch satellites, as well as astronauts and cargo to the International Space Station for NASA. Its first private flight, purchased by a billionaire, was last September. Another is coming up at the end of March, this one to the space station with three businessmen who are paying $55 million apiece.", "url": "https://www.npr.org/2022/02/11/1080046477/spacexs-elon-musk-says-1st-orbital-starship-flight-could-be-as-early-as-march?utm_source=ground.news&utm_medium=referral"}
