{"id": 0, "authors": ["Ariane De Vogue"], "date_publish": "03/25/2022", "description": "The Supreme Court on Friday agreed to temporarily freeze a lower-court opinion requiring the Navy to deploy special operations forces even though they have refused to get vaccinated for Covid-19.", "filename": "https%3A%2F%2Fwww.cnn.com%2F2022%2F03%2F25%2Fpolitics%2Fnavy-covid-supreme-court-seals%2Findex.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.cnn.com", "leaning": 1, "title": "Supreme Court temporarily blocks order requiring Navy to deploy unvaccinated forces", "maintext": "The Supreme Court on Friday agreed to temporarily freeze a lower-court opinion requiring the Navy to deploy special operations forces even though they have refused to get vaccinated for Covid-19.\nThe court's order means that while special operations forces -- including more than two dozen Navy SEALs -- continue to challenge the Navy's vaccine mandate on religious grounds in court, they will not be actively deployed or punished for their position.\nJustices Clarence Thomas, Samuel Alito and Neil Gorsuch dissented.\nAlito, writing for himself and Gorsuch, said that he agreed that the Navy had a \"compelling interest\" in preventing Covid-19 infection from \"impairing its ability to carry out its vital responsibilities\" but that it's \"summary rejection\" of requests for religious exemptions was by \"no means the least restrictive means\" for furthering its interests. He said the challengers \"who have volunteered to undertake demanding and hazardous duties to defend our country\" had been treated \"shabbily\" by the Navy.\nJustice Brett Kavanaugh agreed with the majority and explained his thinking, saying he saw \"no basis\" for employing the \"judicial power in a manner that military commanders believe would impair the military of the United States as it defends the American people.\"\nChallengers in the case – including more than two dozen Navy SEALs – say they have religious objections to the vaccine mandate and are seeking an exemption.\nA district court ruled against the Biden administration, and a federal appeals court declined to step in, saying that it had not demonstrated “paramount interests” that justify vaccinating the plaintiffs in violation of their religious beliefs.\nThe administration did not challenge a portion of the injunction that protected SEALs and other personnel from discipline or discharge for remaining unvaccinated.\nBut the administration wanted the justices to block a part of the ruling requiring the Navy to assign and deploy 35 unvaccinated members of special operations forces while the appeals process plays out.\nSolicitor General Elizabeth Prelogar told the justices in court papers that the Navy has informed her that it has already been forced to send one of the challengers to Hawaii for duty on a submarine \"against its military judgment.\"\nIn court papers, Prelogar stressed that SEALs and other members of the Special Warfare community can be called upon to deploy anywhere in the world on short notice to complete high-risk missions under extreme conditions.\nThe Navy currently requires nine vaccines. It allows two types of exemptions for medical and administrative reasons, which include \"religious accommodations.\" Those exemptions are adjudicated through Navy policies which include a 50-step process to entertain a religious accommodation request.\nIn the seven months since the Covid vaccine was added as a mandatory immunization, the Navy has received more than 4,000 requests for exemptions. Most remain pending, and Prelogar said the Navy has only granted one religious accommodation.\nUnder longstanding policy, Special Warfare servicemembers who cannot be vaccinated for religious reasons are deemed not physically qualified and cannot be assigned to an operation unit.", "url": "https://www.cnn.com/2022/03/25/politics/navy-covid-supreme-court-seals/index.html?utm_source=ground.news&utm_medium=referral"}