{"id": 2, "authors": ["Tom Howell Jr."], "date_publish": "04/28/2022", "description": "Moderna asked the Food and Drug Administration to authorize its COVID-19 vaccine for children age 5 and younger, intensifying the race to immunize the 19 million Americans who remain ineligible for shots against the disease.", "filename": "https%3A%2F%2Fwww.washingtontimes.com%2Fnews%2F2022%2Fapr%2F28%2Fmoderna-asks-fda-authorize-covid-19-vaccine-under-%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.washingtontimes.com", "leaning": 4, "title": "Moderna asks FDA to authorize COVID-19 vaccine for under 6", "maintext": "Moderna asked the Food and Drug Administration to authorize its COVID-19 vaccine for children age 5 and younger, intensifying the race to immunize the 19 million Americans who remain ineligible for shots against the disease.\nThe Massachusetts drugmaker filed its request as some parents clamor to get their children vaccinated and make summer plans. Polls show other parents are sanguine about the situation, figuring younger children tend not to see severe outcomes from COVID-19.\nThe FDA is scheduled to convene its advisory panel in June, a move that should be one of the final steps before a decision on emergency use authorization.\n“We are proud to share that we have initiated our EUA submission for authorization for our COVID-19 vaccine for young children,” Moderna CEO Stéphane Bancel said.\nFDA regulators have acknowledged the need to do their due diligence in authorizing a vaccine that goes into the smallest children.\nModerna and a pair of rivals, Pfizer and BioNTech, have been racing to develop a dosage of the vaccine that is appropriate for the youngest Americans while offering adequate protection, though it has been challenging in the face of the fast-moving omicron variant.\nModerna’s vaccine for those 6 months to 5 years old is given in two doses that are each a quarter of what is given to adults.\nTrials showed it sparked an antibody response similar to the one provided to recipients ages 18 to 25. The company said lab tests suggested the vaccine will be 51% effective against symptomatic infection among those younger than 2 and 37% effective among those 2 to 5.\nWhile relatively low numbers, they are akin to those seen in adults who received two doses amid the omicron variant, meaning a third shot will be needed to bolster protection.\nThe Pfizer-BioNTech team had been ready to move forward earlier this year but the FDA pushed it to wait until it had data on a third dose. The company is expected to file data on a three-dose regimen soon. Its version uses one-tenth of the adult dose in each shot.\nExperts have suggested it might be worthwhile to get initial doses into the youngest children to build some immunity to severe disease while waiting for clearance of boosters.\nIt is unclear if the FDA will review both companies’ applications together. Some feel it might be best to do them together to give parents a full view of what’s available.\nOthers say it doesn’t make sense to wait if one company has submitted its data.\n“I wouldn’t link the two together and say we should wait. That isn’t the way you do it,” said Arthur Caplan, director of the division of medical ethics at the New York University Grossman School of Medicine. “If Pfizer shows up with a better, easier-to-do shot later, they can take over some of the market.”", "url": "https://www.washingtontimes.com/news/2022/apr/28/moderna-asks-fda-authorize-covid-19-vaccine-under-/?utm_source=ground.news&utm_medium=referral"}