<<<<<<< HEAD
{"id": 4, "authors": ["Diane Bartz"], "date_publish": "03/23/2022", "description": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died on Wednesday at the age of 84.", "filename": "https%3A%2F%2Fwww.reuters.com%2Fworld%2Fus%2Fformer-us-secretary-state-madeleine-albright-has-died-family-2022-03-23%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.reuters.com", "leaning": 3, "title": "Madeleine Albright, former U.S. secretary of state and feminist icon, dies at 84", "maintext": "Madeleine Albright, who fled the Nazis as a child in her native Czechoslovakia during World War Two then rose to become the first female U.S. secretary of state and, in her later years, a pop culture feminist icon, died on Wednesday at the age of 84.\nHer family announced her death on Twitter and said she had died of cancer. Leaders, diplomats and academics remembered her as a trailblazer on the world stage.\nAlbright served as U.S. ambassador to the United Nations from 1993-1997 in U.S. President Bill Clinton's administration. He then nominated her to become the first female secretary of state and she served in that role from 1997-2001.\n\"Madeleine Albright was a force. She defied convention and broke barriers again and again,\" U.S. President Joe Biden said. He directed U.S. flags be flown at half-staff at the White House and government buildings, including embassies, until March 27.\nShe was a tough-talking diplomat in an administration that hesitated to involve itself in the two biggest foreign policy crises of the 1990s - the genocides in Rwanda and Bosnia-Herzegovina.\nShe once upset a Pentagon chief by asking why the military maintained more than 1 million men and women under arms if they never used them.\nThe plain-spoken Albright took a tough line on a 1996 incident where Cuban jet fighters downed two unarmed U.S.-based planes, saying: \"This is not cojones, this is cowardice,\" using a Spanish vulgarity meaning \"testicles.\"\nWhile at the United Nations, where Security Council members stood in silence on Wednesday to honor her memory, she pressed for a tougher line against the Serbs in Bosnia after Bosnian Serb military forces laid siege to the capital Sarajevo.\nDuring Clinton's first term, many of his administration's top foreign policy experts did not want to get involved because they vividly remembered how the United States became bogged down in Vietnam.\nIn 1995, Bosnian Serb soldiers overran three Moslem enclaves, Srebrenica, Gorazde and Zepa, and massacred more than 8,000 people.\nThe United States responded by working with NATO on airstrikes that forced an end to the war but only after it had been going on for three years.\nAlbright's experience as a refugee prompted her to push for the United States to use its superpower clout. She wanted a \"muscular internationalism,\" said James O'Brien, a senior adviser to Albright during the Bosnian war.\nEarly in the Clinton administration, while she unsuccessfully advocated for a quicker, stronger response in Bosnia, Albright backed a U.N. war crimes tribunal that eventually put the architects of that war, including Serbian President Slobodan Milosevic and Bosnian Serb leaders, in jail, O'Brien said.\nThe painful lessons learned in Rwanda and Bosnia served the United States well in Kosovo, when Washington saw the more powerful Serbs begin a program of ethnic cleansing of ethnic Albanians. NATO responded with an 11-week campaign of air strikes in 1999 that extended to Belgrade.\nKosovo President Vjosa Osmani said on Wednesday she was “deeply shocked by the loss of Kosovo's great friend,” adding that the intervention \"gave us hope, when we did not have it.\"\nDuring efforts to press North Korea to end its nuclear weapons program, which were eventually unsuccessful, Albright traveled to Pyongyang in 2000 to meet North Korean leader Kim Jong-il, becoming the highest ranking U.S. official to visit the secretive Communist-run country at the time.\n1/8 Former U.S. Secretary of State Madeleine Albright speaks before an interview in Washington, U.S., November 28, 2016. Picture taken November 28, 2016.\nFEMINIST HEROINE\nOnce the Clinton years and the 1990s were over, Albright became an icon to a generation of young women looking for inspiration in their quest for opportunity and respect in the workplace. Albright was fond of saying: \"There's a special place in hell for women who don't help each other.\"\nAlbright was a marked contrast to her predecessors and male colleagues in uniform suits. She used clothes and jewelry to send tart, political messages. One favorite was a snake brooch, a reference to Iraqi leader Saddam Hussein calling her an \"unparalleled serpent.\"\nShe wrote a book about her signature jewelry, one of several bestsellers, explaining that the pins were a diplomatic tool. Balloons or flower pins would indicate she felt optimistic, while a crab or turtle would indicate frustration.\nBorn Marie Jana Korbelova in Prague on May 15, 1937, her family fled in 1939 to London when Germany occupied Czechoslovakia. She attended school in Switzerland at age 10 and adopted the name Madeleine.\nShe was raised a Roman Catholic but after she became secretary of state, the Washington Post dug up documentation showing that her family was Jewish and relatives, including three grandparents, died in the Holocaust. Her parents likely converted to Catholicism from Judaism to avoid persecution as Nazism gained strength in Europe, the paper reported.\nAfter the war, the family left London and returned to Czechoslovakia, then in the throes of a communist takeover.\nHer father, a diplomat and academic who opposed communism, moved the family to the United States where he taught international studies at the University of Denver. One of his favorite students was Condoleezza Rice, who would become the second female secretary of state in 2005 under Republican President George W. Bush.\n\"It is quite remarkable that this Czech émigré professor has trained two secretaries of state,\" Albright told the New York Times in 2006.\nAlbright attended Wellesley College in Massachusetts, and got a doctorate from Columbia University. She became fluent or close to it in six languages including Czech, French, Polish and Russian as well as English.\nIn 1959, she married newspaper heir Joseph Medill Patterson Albright, whom she met while working at the Denver Post, and they had three daughters. They divorced in 1982.\nShe followed her father into academia but also became involved in Democratic Party politics. Albright joined the staff of Senator Edmund Muskie, a Maine Democrat, in 1976 and two years later became a member of President Jimmy Carter's National Security Council staff.\nSince leaving the Clinton administration, she has written a series of books. One, \"Hell and Other Destinations,\" was published in April 2020. Others include her autobiography, \"Madam Secretary: A Memoir\" (2003) and \"Read My Pins: Stories from a Diplomat’s Jewel Box\" (2009).\nThe plain-spoken Albright made forays into popular culture. \"Parks and Recreation\" star Amy Poehler's character had a picture of Albright in her office.\nIn 2005, the \"Gilmore Girls\" television series the character Rory dreamt that Albright, wearing a red suit and an eagle pin, was her mother.\nIn 2018, she and fellow former secretaries of state Colin Powell and Hillary Clinton briefed a fictional secretary of state in \"Madam Secretary,\" a TV drama where she spoke passionately about the dangers of abusive nationalism.", "url": "https://www.reuters.com/world/us/former-us-secretary-state-madeleine-albright-has-died-family-2022-03-23/?utm_source=ground.news&utm_medium=referral"}
=======
{"id": 7, "authors": ["Mary Clare Jalonick", "Mark Sherman"], "date_publish": "03/22/2022", "description": "Supreme Court nominee Ketanji Brown Jackson will face senators’ questions for the first time Tuesday as Democrats push to quickly confirm the only Black female justice in the court’s 233-year history. Live updates here.", "filename": "https%3A%2F%2Fapnews.com%2Farticle%2Fketanji-brown-jackson-hearing-day-2-live-updates-219ce62acd87ca205163781f5b6623a0%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "apnews.com", "leaning": 3, "title": "Jackson pushes back on GOP critics, defends record", "maintext": "Facing senators’ questions for the first time, Supreme Court nominee Ketanji Brown Jackson forcefully defended her record as a federal judge Tuesday and declared she will rule “from a position of neutrality” if she is confirmed as the first Black woman on the high court.\nJackson responded to Republicans who have questioned whether she is too liberal in her judicial philosophy, saying she tries to “understand what the people who created this law intended.” She said she relies on the words of a statute but also looks to history and practice when the meaning may not be clear.\nShe also pushed back on Republican suggestions that she has given light sentences to child pornographers.\nCould her rulings have endangered children? “As a mother and a judge,” she said, “nothing could be further from the truth.”\nShe described looking into the eyes of defendants and explaining the lifelong effects on victims. She said it is “important to me to represent that the children’s voices are represented.”\nTuesday’s hearing was the first of two days of questioning after Jackson and the 22 members of the panel gave opening statements on Monday. On Thursday, the committee will hear from legal experts before an eventual vote to move her nomination to the Senate floor.\nBarring unexpected developments, Democrats who control the Senate by the slimmest of margins hope to wrap up Jackson’s confirmation before Easter, though Breyer is not leaving the court until after the current session ends this summer.\nIn what Judiciary Committee Chairman Dick Durbin, D-Ill., described as “a trial by ordeal,” Jackson answered questions right off the bat that attempted to deflect GOP concerns and also highlight the empathetic style that she has frequently described when she is handing down sentences. Republicans planned to use their questioning to brand Jackson — and Democrats in general — as soft on crime, an emerging theme in GOP midterm election campaigns.\nJackson told the committee that her brother and two uncles served as police officers, and “crime and the effect on the community, and the need for law enforcement — those are not abstract concepts or political slogans to me.”\nShe also defended work she did around 15 years ago as a public defender and later in private practice representing four Guantanamo Bay detainees. While some Republicans have complained that Jackson was defending terrorists, she noted that defenders don’t pick their clients and are “standing up for the constitutional value of representation.” She said she continued to represent one client in private practice because her firm happened to be assigned his case.\nShe bristled at questions from South Carolina Sen. Lindsey Graham, who voted for her confirmation as an appeals court judge last year but has openly expressed his frustration after President Joe Biden picked her over a South Carolina judge. Graham asked her about her religion, and how often she goes to church, in emotional comments about what he said was unfair criticism of Justice Amy Coney Barrett’s Catholicism ahead of her 2020 confirmation.\nJackson — who thanked God in her opening statement and said that her faith “sustains me at this moment” — responded that she is a Protestant. But she said she is reluctant to talk about her faith in detail because “I want to be mindful of the need for the public to have confidence in my ability to separate out my personal views.”\nDemocrats have been full of praise for Biden’s Supreme Court nominee, noting that she would not only be the first Black woman but also the first public defender on the court, and first with experience representing indigent criminal defendants since Justice Thurgood Marshall.\nCommittee Chairman Durbin said that to be first, “often, you have to be the best, in some ways the bravest.”\nBiden chose Jackson in February, fulfilling a campaign pledge to nominate a Black woman to the Supreme Court for the first time in American history. She would take the seat of Justice Stephen Breyer, who announced in January that he would retire after 28 years on the court.\nSen. Cory Booker, D-N.J., spoke emotionally about the “joy” he felt about her historic nomination and acknowledged her family’s pride. Jackson would be the third Black justice, after Marshall and Clarence Thomas, and the sixth woman.\nBooker, who is Black, said the white men who have sat on the Supreme Court for two centuries were “extraordinary patriots who helped shape this country” but that many people could have never dreamed of sitting on the court.\nJackson, who grew up in Miami, noted that she did not have to attend racially segregated public schools like her own parents did, “and the fact that we had come that far was to me a testament to the hope and the promise of this country, the greatness of America that in one generation we could go from racially segregated schools in Florida to have me sitting here as the first Floridian ever to be nominated to the Supreme Court of the United States.”\nOn Monday, Democrats on the Judiciary panel sought to preemptively rebut Republican criticism of Jackson’s record on criminal matters as a judge, as a federal public defender and a member of the U.S. Sentencing Commission, an independent agency created by Congress to reduce disparity in federal prison sentences.\nJackson “is not anti-law enforcement” and is not “soft on crime,” Sen. Patrick Leahy, D-Vt., said, noting that her support from some national police organizations. ”Judge Jackson is no judicial activist.”\nQuestions about her sentences for child pornographers first came from Sen. Josh Hawley, R-Mo., who said in his opening statement that his research showed that she had a pattern of issuing lower sentences in child pornography cases, repeating comments he wrote in a Twitter thread last week. The Republican National Committee echoed his claims in blast messages to supporters.\nThe White House, along with several Democrats at the hearing, has rejected Hawley’s criticism as “toxic and weakly presented misinformation.” Sentencing expert Douglas Berman, an Ohio State law professor, wrote on his blog that Jackson’s record shows she is skeptical of the range of prison terms recommended for child pornography cases, “but so too were prosecutors in the majority of her cases and so too are district judges nationwide.”\nHawley is one of several committee Republicans, along with Ted Cruz of Texas and Tom Cotton of Arkansas, who are potential 2024 presidential candidates, and their aspirations may collide with other Republicans who would prefer not to pursue a scorched-earth approach to Jackson’s nomination.\nJackson appeared before the Judiciary committee last year after Biden chose her to fill an opening on the federal appeals court in Washington . She was also vetted by the committee and confirmed by the Senate as a district court judge under President Barack Obama and to her post on the sentencing commission.", "url": "https://apnews.com/article/ketanji-brown-jackson-hearing-day-2-live-updates-219ce62acd87ca205163781f5b6623a0?utm_source=ground.news&utm_medium=referral"}
>>>>>>> 742890e3483e1c3e6b8ce137f756335d2c22959d
