{"id": 8, "authors": ["Sarah E. Needleman"], "date_publish": "04/28/2022", "description": "The messaging service, which agreed to be acquired in a $44 billion deal, says it overstated its number of users in recent years.", "filename": "https%3A%2F%2Fwww.wsj.com%2Farticles%2Ftwitter-reports-higher-revenue-users-as-elon-musk-prepares-to-buy-it-11651147925%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["tech"], "source_domain": "www.wsj.com", "leaning": 4, "title": "Twitter Reports Higher Revenue, Users as Elon Musk Prepares to Buy It", "maintext": "Twitter Inc.’s TWTR 0.97% revenue rose 16% in the first quarter and its number of users increased, as the company prepares to be acquired by Elon Musk and go private.\nThe improved results may offer little meaning, with Mr. Musk expected to implement changes to Twitter’s business model and its messaging platform once the $44 billion deal is finalized. The billionaire has floated moves including relying less on advertising to generate revenue and loosening content-moderation rules that could impact ad placement and the user experience.\nTwitter said Thursday that it was withdrawing all previously provided goals and outlooks, and it wouldn’t provide any forward-looking guidance. Before Mr. Musk’s courtship, Twitter had been working to achieve three main goals by the end of 2023: to surpass $7.5 billion in annual revenue, reach 315 million daily users and double the pace at which it produces new technology.\nSHARE YOUR THOUGHTS What does Twitter’s earnings report suggest about the company’s long-term health? Join the conversation below.\nBecause of its pending sale to Mr. Musk, announced Monday, Twitter said it wouldn’t host a conference call with analysts to discuss the results.\nAt an all-hands employee meeting late Monday, Chief Executive Officer Parag Agrawal said that no layoffs were planned and the company’s priorities aren’t changing before the deal closes, according to a person who heard the remarks.\nIn what may be one of its final earnings reports as a public company, Twitter said its daily user base rose to 229 million from 214.7 million in the December-ended quarter. Analysts polled by FactSet had expected a user count of about 226 million.\nTwitter said Thursday that it had overstated its user base for nearly three years through the end of 2021 because of an error in how it accounted for people linked to multiple accounts. The company provided restated figures, including lowering its December quarter number to 214.7 million from 217 million.\nThe mistake “is definitely another black eye for management at a time when Musk has already been pretty critical of them and their ability to execute,” said Truist Securities analyst Youssef H. Squali.\nTwitter shares slipped 10 cents to $48.54 in morning trading; the stock is up 12% year to date. Mr. Musk’s offer values Twitter at $54.20 a share.\nTwitter’s revenue rose to $1.2 billion in the first quarter from $1.04 billion a year earlier. Analysts had forecast revenue of $1.23 billion, according to FactSet. Twitter noted headwinds associated with the war in Ukraine, which Cascend Securities analyst Eric Ross found puzzling because Twitter is designed to disseminate news.\n“Twitter should be benefiting from this. Why is that not happening?” Mr. Ross said.\nAdvertising revenue increased 23% to $1.11 billion. The results come as its social-media peers such as Snap Inc. and Meta Platform Inc.’s Facebook have seen their advertising sales dented by Apple Inc.’s new privacy rules.\nTwitter reported earnings of $513 million, which included a pretax gain of $970 million from the sale of mobile ad firm MoPub to AppLovin Corp.\nTwitter said expenses in the quarter increased 35% and resulted in an operating loss of $128 million, compared with operating income of $52 million in the year-earlier quarter.\nTwitter’s earnings report shows that the company is capable of improving engagement, but “its financial execution against that usage is underwhelming,” said Chas Cocke, founder and chief executive of hedge fund LB Partners LLC. Of the $100 million the firm manages, more than 10% was invested in the social-media company until Monday when it sold the shares.\n“Twitter seems to be throwing headcount at the problem, which is leading to a bloated cost structure in relation to its revenue base,” Mr. Cocke said. “One can imagine this is precisely the financial opportunity that Elon Musk sees.”\nMr. Musk’s deal for Twitter—funded through bank debt and cash promised by the billionaire himself—raises questions about the social-media company’s financial footing. The transaction could nearly triple its leverage and saddle it with hundreds of millions of dollars in interest payable on the more than $25 billion used to fund the leveraged buyout.\nS&P Global Ratings said Tuesday that it expects the substantial increase in Twitter’s leverage to lead to a potential multinotch downgrade of the company’s credit rating, which currently is BB+, or below investment grade.\nTo service the debt, Mr. Musk will need to preserve Twitter’s cash flow and grow it, which would be difficult without advertising. Mr. Musk has proposed changes for the company that include relying less on advertising. Ads currently account for around 90% of Twitter’s revenue.\nTwitter introduced Twitter Blue, its first consumer subscription offering, to the U.S. market in November. Mr. Agrawal said on Twitter’s last earnings call in February that Blue appeals to the company’s “most heavy users” but wasn’t critical to achieving its 2023 revenue goal at the time.\nMr. Musk, should he take over the company, faces other challenges ahead. He has pledged to adopt a more hands-off approach to moderating speech on Twitter, saying in a tweet Monday that he wants the platform to be a destination for wide-ranging discourse and disagreement. On Tuesday, the internal market commissioner at the European Union cautioned that he would need to follow the bloc’s new rules on content moderation.", "url": "https://www.wsj.com/articles/twitter-reports-higher-revenue-users-as-elon-musk-prepares-to-buy-it-11651147925?utm_source=ground.news&utm_medium=referral"}