{"id": 1, "authors": ["Michael Erman", "Julie Steenhuysen"], "date_publish": "04/28/2022", "description": "Moderna Inc said on Thursday it asked U.S. regulators to authorize its COVID-19 vaccine for children under the age of 6, which would make it the first shot against the coronavirus available for those under 5-years-old.", "filename": "https%3A%2F%2Fwww.reuters.com%2Fbusiness%2Fhealthcare-pharmaceuticals%2Fmoderna-files-us-authorization-covid-shot-kids-under-6-2022-04-28%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.reuters.com", "leaning": 3, "title": "Moderna files for U.S. authorization of COVID shot for kids under 6", "maintext": "Moderna Inc (MRNA.O) said on Thursday it asked U.S. regulators to authorize its COVID-19 vaccine for children under the age of 6, which would make it the first shot against the coronavirus available for those under 5-years-old.\nThe COVID-19 vaccine from Pfizer Inc (PFE.N) and BioNTech SE (22UAy.DE) is authorized for children 5 and older. But their trial results for 2- to 4-year-olds showed a weaker immune response than in adults, forcing the study to be extended to test a third dose. Pfizer has said that data would come in April.\n\"This does represent an important area of unmet need,\" Moderna Chief Medical Officer Paul Burton said in an interview.\n\"There's no other vaccine, no other therapy, that these little kids can have,\" Burton said. \"If they do judge the data to be sufficient, I think from a public health perspective, offering it to these children as quickly as possible is the best thing.\"\nModerna released trial data in March showing that its vaccine was safe and generated a similar immune response in young children as for adults, which was the goal of the study.\nThe Omicron variant of the coronavirus, which has been shown to evade vaccine immunity compared with earlier versions, was predominant during the pediatric trial. The drugmaker said two doses were around 37% effective in preventing infections in 2- to 5-year-olds and 51% effective for children ages 6 months to 2 years.\nBurton did not disclose a time frame for when the U.S. Food and Drug Administration was expected to consider the authorization request.\nTop U.S. infectious disease expert Dr. Anthony Fauci suggested in an interview last week with CNN that the FDA hopes to review data from the Pfizer/BioNTech vaccine in the age group alongside the Moderna data.\nIt is not clear how many U.S. parents of will want to vaccinate their children in the age group. Only 28% of U.S. children in the 5 to 11 age group are fully vaccinated, and COVID-19 is often more mild in children than adults.\nThe U.S. Centers for Disease Control and Prevention released data on Tuesday showing that 75% of U.S. children had evidence of prior COVID infection in their blood, much of which occurred during the Omicron surge from December through February. read more\nStill, Burton urged parents to vaccinate their children.\n\"COVID is a bad disease. These variants now are highly transmissible,\" he said.\n\"I do believe that getting vaccinated now should protect these kids: protect them against severe disease, hospitalization, protect them against the long-term effects of COVID. So it makes sense to get vaccinated,\" Burton added.\nThe American Academy of Pediatrics last week urged a swift review of the data in a Twitter post, noting declines in other protections such as masking.\n\"With no known date for an authorized under 5 vaccine, we urge data once available to be submitted and reviewed ASAP so that we can offer a safe, effective vaccine to our littlest children.\"", "url": "https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-files-us-authorization-covid-shot-kids-under-6-2022-04-28/?utm_source=ground.news&utm_medium=referral"}