{
    "id": "5",
    "authors": [
    ],
    "date_publish": "02/02/2021",
    "description": "President Biden has agreed to send thousands more troops to Eastern Europe to bolster NATO allies in the region.",
    "filename": "https%3A%2F%2Fnypost.com%2F2022%2F02%2F02%2Fbiden-approves-thousands-of-additional-troops-to-eastern-europe%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "politics"
    ],
    "source_domain": "nypost.com",
    "leaning": 4,
    "title": "Biden approves 3000 additional troops to Eastern Europe",
    "maintext": "The Biden administration will deploy 3,000 forces to Eastern and Central Europe to bolster the “deterrence and defensive posture” of NATO amid the backdrop of a potential Russian invasion of Ukraine, the Pentagon said Wednesday.\nPress secretary John Kirby announced that 1,000 US troops based in Germany will be shifted to Romania, joining 900 US forces already there. Of the remaining 2,000 forces, members of the 82nd Airborne and components of an Infantry Bridge Combat team will be sent to Poland, while members of the 18th Airborne Corps will be deployed to Germany.\n“These movements are unmistakable signals to the world that we stand ready to reassure our NATO allies and deter and defend against any aggression,” Kirby told reporters.\n“The current situation demands that we reinforce the deterrence and defensive posture on NATO’s eastern flank,” he added. “President Biden has been clear that the United States will respond to the growing threat to Europe’s security and stability. Our commitment to NATO Article Five and collective defense remains ironclad.”\nArticle Five refers to the Atlantic alliance’s policy that an attack on one of its members constitutes an attack on every member. Poland and Romania are both members of NATO and share borders with Ukraine.\n The troops going to Romania are part of a Stryker Squadron, a mounted cavalry unit designed to deploy quickly, and are being sent at the “express invitation” of the Bucharest government, according to Kirby.\nKirby insisted that the troop movements are not “permanent” and are designed to respond to the “current security environment.”\n“Moreover,” he added, “these forces are not going to fight in Ukraine. \n The US forces are expected to be shipped out in the next few days, officials told the Wall Street Journal.\nNATO Secretary General Jens Stoltenberg said in a statement that the US deployment was “welcome” and “a powerful signal of US commitment.”\n“Our deployments are defensive and proportional, and send the clear message that NATO will do whatever is necessary to protect and defend all Allies,” Stoltenberg said. “As we face a changed security environment, North America and Europe continue standing together in NATO, determined to keep our collective deterrence and defense [sic] strong.”\nKirby said Russian President Vladimir Putin, who has already deployed an estimated 100,000 troops and military equipment along Ukraine’s borders, continues to add to his forces and has moved military personnel into Belarus.\n“Even over just the last 24 hours, he continues to add in western Russia and Belarus and … in the Mediterranean and the North Atlantic,” the press secretary said. “He has shown no signs of being interested or willing to deescalate the tensions. And it’s not just the United States that’s noticed this. Our NATO allies have noticed this.”\nMilitary personnel who are part of the new forces could also be used to help evacuate the approximately 30,000 Americans living in Ukraine, one official told the Journal.\nIf that happens, it’s unlikely the troops would be sent inside Ukraine but instead would manage the operation along the Ukrainian border.\n“Our troops are multi-mission capable and they will be prepared for a range of contingencies,” Kirby told reporters when asked about the possibility Wednesday. “I won’t go any further than that.”\nLast week, the US announced it had put 8,500 forces on “heightened alert” in the event they were needed as part of a 40,000-strong NATO Response Force. On Friday, Biden told reporters that “I’ll be moving troops to Eastern Europe and the NATO countries in the near term,” before adding that the number would be “not too many.",
    "url": "https://nypost.com/2022/02/02/biden-approves-thousands-of-additional-troops-to-eastern-europe/?utm_source=ground.news&utm_medium=referral"
}