{"id": 6, "authors": ["Katie Rogers"], "date_publish": "03/22/2022", "description": "“Nothing could be further from the truth,” she told the Senate Judiciary Committee.", "filename": "https%3A%2F%2Fwww.nytimes.com%2F2022%2F03%2F22%2Fus%2Fpolitics%2Fketanji-brown-jackson-child-sexual-abuse.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.nytimes.com", "leaning": 2, "title": "Jackson Rejects Accusations of Leniency in Child Sexual Abuse Cases", "maintext": "Judge Jackson gave a lengthy and emphatic counter on Tuesday to Republican accusations that she has been lenient in sentencing defendants in child sex-abuse cases, using her first chance to address the matter before the Senate Judiciary Committee to assert that “nothing could be further from the truth.”\nSenator Richard Durbin, Democrat of Illinois and the committee’s chairman, teed up the topic for Judge Jackson by asking her what went through her mind on Monday as she sat and listened, with her family looking on, as a host of Republicans accused her of having coddled sex offenders in her rulings and sentencing recommendations. Clearly anticipating the question, she used the moment to deliver a clear response that telegraphed some of her anger at those attacks.\n“I was thinking that nothing could be further from the truth,” Judge Jackson responded. “These are some of the most difficult cases that a judge has to deal with because we’re talking about sex abuse of children,” she said.\nJudge Jackson pushed back forcefully on the notion that she had any tolerance for such crimes, calling them “sickening and egregious.” And she gave a lengthy explanation of how she arrived at her sentences in the cases in question.\n\"I impose a strict sentence and all of the additional restraints that are available in the law,\"Judge Jackson said.\"These people cannot use computers in a normal way for decades. I am imposing all of those constraints because I understand how significant, how damaging, how horrible this crime is.\"\nAnd Judge Jackson said she works to ensure that sexual abusers of children understand the devastating impact their actions have on survivors, sharing the story of one victim who had developed agoraphobia and could not leave her home.\n\"She thinks everyone she meets will have seen her pictures on the internet, at the most vulnerable time of her life. So she's paralyzed,” Judge Jackson said. “I tell that story to every child porn defendant as a part of my sentencing, so that they understand what they have done.\"\nSeveral Republicans have misleadingly claimed that, as a member of a federal sentencing commission, Judge Jackson pressed for lower penalties for such defendants and, as a judge, handed down sentences in such cases that were shorter than the guidelines laid out under existing statutes.\nSenator Josh Hawley, Republican of Missouri, has led that charge, writing on Twitter that Judge Jackson \"has a pattern of letting child porn offenders off the hook for their appalling crimes, both as a judge and as a policymaker.\"\nOn Monday, Senator Marsha Blackburn, Republican of Tennessee, said from the dais that Judge Jackson had a “consistent pattern of giving child porn offenders lighter sentences. On average, you sentence child porn defendants to over five years below the minimum sentence recommended by the sentencing guidelines. And you have stated publicly that it is a mistake to assume that child pornography offenders are pedophiles.\"\nThe claims made by both senators distort Judge Jackson's views and her approach to sentencing. Under existing guidelines, there is no mandatory minimum sentence for possession of such material, but receipt, transportation or distribution carries a five-year minimum.\nOn Tuesday, Judge Jackson said that existing statutes don't necessarily call for “the highest possible penalty,” but to “impose a sentence that is ‘sufficient but is not greater than necessary to promote the purposes of punishment.'\"", "url": "https://www.nytimes.com/2022/03/22/us/politics/ketanji-brown-jackson-child-sexual-abuse.html?utm_source=ground.news&utm_medium=referral"}