{"id": 1, "authors": ["Lawrence Hurley"], "date_publish": "03/25/2022", "description": "The U.S. Supreme Court on Friday granted a request by President Joe Biden's administration to let the Navy decline to deploy SEALs and other special operations forces personnel who refused mandatory COVID-19 vaccination due to religious objections.", "filename": "https%3A%2F%2Fwww.reuters.com%2Fworld%2Fus%2Fus-supreme-court-backs-navy-fight-with-anti-vaccine-seals-2022-03-25%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.reuters.com", "leaning": 3, "title": "U.S. Supreme Court backs Navy in fight with anti-vaccine SEALs", "maintext": "The U.S. Supreme Court on Friday granted a request by President Joe Biden's administration to let the Navy decline to deploy SEALs and other special operations forces personnel who refused mandatory COVID-19 vaccination due to religious objections.\nThe court put on hold part of a federal judge's ruling stating that 26 members of the elite Navy SEALs and nine other special operations forces personnel were entitled to a religious exemption to the vaccine requirement under the U.S. Constitution's First Amendment, which protects the free exercise of religion, as well as a law called the Religious Freedom Restoration Act.\n\"In this case, the district court, while no doubt well-intentioned, in effect inserted itself into the Navy’s chain of command, overriding military commanders’ professional military judgments,\" Justice Brett Kavanaugh wrote in a concurring opinion.\nThe court -- which has a 6-3 conservative majority -- was divided, with three conservative justices saying they would have denied the request.\nIn a dissenting opinion, conservative Justice Samuel Alito said that the court \"does a great injustice\" to the Navy personnel who \"appear to have been treated shabbily.\"\nUnder another part of Texas-based U.S. District Court Judge Reed O'Connor's ruling not affected by the Supreme Court action, the service members cannot be disciplined or discharged as a result of refusing the vaccine.\nBesides the SEALs, the other nine plaintiffs include specialist naval craft crewmen, divers and a bomb disposal expert.\nOn Feb. 28, the New Orleans-based 5th U.S. Circuit Court of Appeals rejected a similar request from Biden's administration.\nThe administration is contesting O'Connor's Jan. 3 decision in favor of the servicemembers, in which the judge wrote that their \"loss of religious liberties outweighs any forthcoming harm to the Navy.\"", "url": "https://www.reuters.com/world/us/us-supreme-court-backs-navy-fight-with-anti-vaccine-seals-2022-03-25/?utm_source=ground.news&utm_medium=referral"}