{"id": 4, "authors": [], "date_publish": "03/22/2022", "description": "The Met says officers have begun interviewing people about the lockdown gatherings in Downing Street.", "filename": "https%3A%2F%2Fwww.bbc.co.uk%2Fnews%2Fuk-politics-60827451%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.bbc.co.uk", "leaning": 3, "title": "Police send over 100 questionnaires on No 10 parties", "maintext": "The Metropolitan Police has sent out over 100 questionnaires as it continues to investigate parties that took place in Downing Street while Covid restrictions were in place.\nThe force said it had now begun interviewing witnesses and may need to contact more over the gatherings.\nIt is formally investigating 12 events, including three the PM attended.\nBoris Johnson has refused to say whether he was at another alleged event, said to have been held in his Downing Street flat in November 2020.\nLeader of the Liberal Democrats, Sir Ed Davey, called on the prime minister \"come clean\" and reveal if he was being interviewed by the police, as well as whether he would resign if found to have broken the law.\nHe added: \"No more fluff, just the facts for all those who suffered during lockdown while he partied.\"\nInitial findings from an inquiry by senior civil servant Sue Gray said there had been \"failures of leadership and judgement\" over the parties, as well as excessive drinking at work against the backdrop of the pandemic.\nShe has pledged to update her report after the police finish their investigation.\nIn a statement on Monday, the Met said detectives from the Operation Hillman investigation team had started interviewing \"key witnesses\".\"To date, over 100 questionnaires have been sent out asking the recipients about their participation in alleged gatherings.\"\n\"The questionnaires provide recipients with the opportunity to give an account of their involvement and the responses form part of the investigative material for the operation.\"\n All recipients including both the prime minister and Chancellor Rishi Sunak - were given seven days to respond.\nThe statement said: \"As a result of responses so far, further individuals have been identified and questionnaires sent to them.\"\n\"As the investigation continues, we may need to contact more people as further information comes to light.\"\nThe force has not issued any fixed penalty notices for breaching of lockdown rules in connection with events in Downing Street and Whitehall.\nBut the Met added: \"Every questionnaire response is being assessed alongside all available evidence, and should this reach the evidential threshold, then referrals will be made.\nThe Met's statement seems to have dashed any hopes that No 10 may have had for a swift conclusion to the so-called \"partygate\" probe.\nIndeed, inquiries into events in Downing Street and nearby government buildings in 2020 and 2021 appear to be expanding.\nAnd there have been suggestions that the size of the police inquiry team is to be increased to deal with the volume of work.\nI was told that some Downing Street staff had felt aggrieved to have received police questionnaires, while some of their colleagues who had attended the same events had not.\nIt now seems that some of them may have been pointing fingers, leading to more police questionnaires being issued and elongating the whole process.\nAnd the full report by senior civil servant Sue Gray can't be published until the police conclude their inquiries.\nTwo Conservative MPs have withdrawn letters of no confidence in the prime minister, believing it would be wrong to hold a leadership contest against the backdrop of the Ukraine conflict.\nBut some others have told me they have no intention of doing so, and that a long-running investigation has the potential to inflict serious political damage to Boris Johnson.", "url": "https://www.bbc.co.uk/news/uk-politics-60827451?utm_source=ground.news&utm_medium=referral"}