{"id": "0", "authors": ["Abc News", "Carla K. Johnson Ap Medical Writer", "September"], "date_publish": "9/30/21", "description": "People who got a two-dose vaccine or one dose of the Johnson & Johnson shot are considered fully vaccinated — even without a booster", "filename": "https%3A%2F%2Fabcnews.go.com%2FHealth%2FwireStory%2Ffully-vaccinated-covid-19-vaccine-booster-80319090.json", "image_url": null, "topic": ["vaccine"], "source_domain": "abcnews.go.com", "leaning": 2, "title": "Am I fully vaccinated without a COVID-19 vaccine booster?", "maintext": "People who got a two-dose vaccine or one dose of the Johnson & Johnson shot are considered fully vaccinated — even without a booster\nAm I fully vaccinated without a COVID-19 vaccine booster?\nYes, people who got a two-dose vaccine or the single-dose Johnson & Johnson shot are considered fully vaccinated — even without a booster.\nThe U.S. Centers for Disease Control and Prevention says you're fully vaccinated two weeks after receiving a second dose of the Pfizer or Moderna vaccine, or one dose of the J&J.\nThe vaccines offer strong protection against serious illness. But U.S. health officials now recommend boosters for some people at higher risk for severe illness from COVID-19 based on evidence that protection against milder disease can wane, especially among older adults.\nThe CDC says people 65 and older, long-term care residents and others ages 50 to 64 with health problems such as diabetes or heart disease should get boosters if they got Pfizer shots at least six months ago.\nThe agency stopped short of recommending boosters for people 18 to 49 with health problems, but says they can also get the shot after considering their individual risk. The same is true for anyone 18 to 64 whose job could put them at higher risk for infection, such as health care workers, teachers, first responders, agriculture workers and public transit workers.\nPeople who got the Moderna and J&J vaccines aren't eligible for boosters yet, but that's likely coming soon.\nThe availability of boosters varies around the world. Britain and Israel have also been giving boosters, despite objections from the World Health Organization that poor countries still don’t have enough for their initial doses.\n———\nThe AP is answering your questions about the coronavirus in this series. Submit them at: FactCheck@AP.org. Read more here:\nIs the delta variant of the coronavirus worse for kids?\nCan I get ‘long COVID’ if I’m infected after vaccination?\nWhat is a COVID-19 vaccine passport, and do I need one?", "url": "https://abcnews.go.com/Health/wireStory/fully-vaccinated-covid-19-vaccine-booster-80319090"}