{
    "id": "8",
    "authors": [],
    "date_publish": "02/02/2021",
    "description": "The 20-year-old striker was arrested on suspicion of rape, sexual assault and making threats to kill.",
    "filename": "https%3A%2F%2Fwww.bbc.com%2Fnews%2Fuk-england-manchester-60223802%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "sports"
    ],
    "source_domain": "www.bbc.com",
    "leaning": 3,
    "title": "Mason Greenwood: Man Utd footballer released on bail",
    "maintext": "Manchester United footballer Mason Greenwood has been released on bail after being arrested on suspicion of raping a woman. \nThe 20 year old was also arrested on suspicion of assault on Sunday following allegations on social media.\n He was then further arrested on suspicion of sexual assault and making threats to kill on Tuesday.\n Manchester United previously said the forward would not return to training or matches until further notice.\n Greater Manchester Police said Greenwood was arrested after the force \"became aware of online social media images and videos posted by a woman reporting incidents of physical violence\".\n It said magistrates had granted a second extension to keep him in custody until Wednesday but he had now been bailed pending further investigations. \n Following the striker's arrest, video game developer EA Sports said Greenwood had been removed from FIFA products.\n It said he had been taken out of active squads in FIFA 22 and suspended from appearing in FIFA Ultimate Team packs and Ultimate Draft.\nSportswear firm Nike previously said it had suspended its relationship with the footballer.\n\"We are deeply concerned by the disturbing allegations and will continue to closely monitor the situation,\" a spokesman said.\n Greenwood, who made his Manchester United debut in March 2019, signed a four-year deal in February last year after rising through the ranks of the academy.\n On Sunday, the club said it \"did not condone violence of any kind\" and had been made aware of the allegations but would make no further comment until the \"facts have been established\".\n In a further statement on Tuesday, the club said it \"reiterates its strong condemnation of violence of any kind\".",
    "url": "https://www.bbc.com/news/uk-england-manchester-60223802?utm_source=ground.news&utm_medium=referral"
}