{
	"id": 2,
	"authors": ["Jordan Dixon-Hamilton"],
	"date_publish": "2021-10-20 00:20:00",
	"description": "California teachers and parents on Monday are planning a statewide walkout to protest Gov. Gavin Newsom’s vaccine mandates.",
	"filename": "https%3A%2F%2Fwww.breitbart.com%2Fpolitics%2F2021%2F10%2F18%2Fcalifornia-teachers-parents-plan-statewide-walkout-over-gov-newsoms-vaccine-mandate%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
	"image_url": "https://media.breitbart.com/media/2021/06/filejan19-Los-Angeles-Teachers-Union-getty-640x335.jpg",
	"topic": "vaccine",
	"source_domain": "www.breitbart.com",
	"leaning": "4",
	"title": "California Teachers and Parents Plan Walkout over Vaccine Mandate",
	"maintext": "California teachers and parents on Monday are planning a statewide walkout in protest of Gov. Gavin Newsom’s (D) vaccine mandates for public and private schools.\nCalifornia became the first state to require coronavirus vaccines for grades K through 12 to attend in-person classes after Newsom announced the mandate on October 1. The order currently affects students older than 12, and it will affect children aged 5 to 11 once the vaccine gets final federal approval. Newsom’s plan impacts both public and private schools and also includes exemptions for religious and medical reasons.\nStaff and teachers are also required to get the vaccine or submit to testing under the mandate.\nThousands of parents are expected to keep their children home from school, with teachers and staff being encouraged to skip out on the day as well.\n1/ On Monday 10/18, I will be participating in the California statewide school walkout. My 5yo and I will be protesting the anti-science, anti-child, anti-bodily autonomy, and anti-parent policies that the government has imposed, with no end in sight, for 19 months. pic.twitter.com/MHtdUdsZx1 — Sarah Beth Burwick (@sarahbeth345) October 17, 2021\nOne motivator for the protests is the money schools will miss out on if kids are not present in class. “We know that if our children stay home from school that that will impact the funding that schools will get for that day,” California parent Babe Prieto explained. “And we want them to know that we’re serious about not being forced to vaccinate our children.”\nAccording to the California Department of Education, state funding per student is $13,976. With California requiring schools to teach at least 180 days of the year, schools are getting up to $78 per student daily.\nOne California school is canceling all classes on Monday because of the protest. Oak Run Elementary in Shasta County reportedly sent a letter to families saying, “Parents, educators, and students across the U.S. will engage in peaceful noncompliance activities to remind government officials that individuals should have the final say when it comes to their health.”\nAmy Keurentjes, a doctor and mother of five, told a local newspaper, “I’m just out here fighting for freedom. I want to see freedom for health care workers. I want to see freedom for educators.”\nIn addition to the walkout, thousands are expected to attend a protest scheduled in Sacramento. According to CalMatters, “around 2,500 people are slated to protest in front of the state Capitol building in Sacramento for an event called ‘Our Children, Our Choice.’”\nCalifornia parents and teachers are not alone in their opposition to Newsom’s vaccine mandates. According to the Sacramento Bee, nearly 40% of state workers remain unvaccinated, despite Newsom’s July order requiring all state employees to get vaccinated.",
	"url": "https://www.breitbart.com/politics/2021/10/18/california-teachers-parents-plan-statewide-walkout-over-gov-newsoms-vaccine-mandate/?utm_source=ground.news&utm_medium=referral"
}
