{"id": 8, "authors": [], "date_publish": "02/02/2022", "description": "Elon Musk said his space company’s enormous rocket should soon be able to reach orbits at a fraction of traditional launch costs.", "filename": "https%3A%2F%2Fwww.foxbusiness.com%2Fmarkets%2Felon-musk-expects-starship-to-deliver-launches-at-lower-costs%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["technology"], "source_domain": "www.foxbusiness.com", "leaning": 5, "title": "Elon Musk expects Starship to deliver launches at lower costs", "maintext": "Elon Musk said his space company’s enormous rocket should soon be able to reach orbits at a fraction of traditional launch costs.\nStarship should be able to reach orbits for less than $10 million a flight within two to three years, Mr. Musk said during a presentation Thursday at SpaceX’s southern Texas facility, where the company plans to launch the spacecraft. \n SpaceX has previously said that the company would use Starship, the biggest and most powerful rocket it has built to date, for its most ambitious missions, including a potential trip to Mars. The vehicle is meant to be fully and rapidly reusable and forms an important part of the company’s business, according to analysts, as it could potentially deliver hundreds of satellites to orbit at once, including those that make up SpaceX’s own growing fleet of broadband satellites.\n\"We need to accomplish that—that’s not done yet,\" Mr. Musk said of proving Starship can achieve the reusability goals. \"But success is one of the possible outcomes.\"\nHe said the company has continued to make improvements to Starship to support future missions. A second version of the spacecraft’s engine, called Raptor, costs about half as much as a prior version, even though the newer edition is more powerful, Mr. Musk said.\nDuring his presentation, Mr. Musk described civilization as feeling \"a little fragile these days\" and made his case for reaching Mars to build a self-sustaining city.\nMr. Musk had said at a December event organized by the Journal that Starship was proving to be a very difficult project. Not long before, he had said on Twitter that bankruptcy for SpaceX wasn’t out of the question if a severe recession made access to capital more difficult while the company was losing billions on Starship and its satellite internet service.\nThe Federal Aviation Administration, which regulates space launches, has been reviewing how SpaceX’s plans for Starship could affect public safety, the environment near the Starbase facility and other factors.\nThe Starship rocket system comprises two vehicles. The Super Heavy booster, 230 feet tall and fueled by liquid methane and liquid oxygen, would lift the Starship spacecraft, designed to be stacked atop it, into orbit. Starship, 160 feet tall, is meant to carry up to 100 people or complete cargo missions, according to a guide SpaceX posted to its website.\nSpace Exploration Technologies Corp., the formal name for SpaceX, has said it designed the Starship spacecraft to carry more than 100 tons to destinations like the moon. That would be more than double the amount that a Saturn V rocket, used by National Aeronautics and Space Administration for astronaut missions to the moon, was capable of propelling to the lunar surface.Last April, NASA awarded SpaceX a $2.9 billion contract to use Starship to deliver astronauts to the lunar surface from Gateway, an agency outpost that would orbit the moon, or from NASA’s Orion spacecraft. Rivals that SpaceX beat out to win the high-profile contract included a team led by Jeff Bezos’ Blue Origin LLC.\nSpaceX has conducted limited tests of Starship at its Starbase facility in Boca Chica, Texas. Some of the test vehicles have exploded during testing. Last May, the company successfully landed a Starship at the Texas site.\nUnder its current agreement with the FAA, the company can conduct suborbital launches that don’t send Starship prototype vehicles more than 18 miles from the ground, according to the agency. ßThe company cannot pursue a broader testing program for Starship until it obtains certain permissions from the FAA’s commercial-space office.\nMr. Musk said SpaceX doesn’t know the status of the FAA review but said there could be an approval in March. The FAA couldn’t immediately be reached for comment.\n Last year, the FAA held hearings about the Starship proposal and ultimately received around 18,000 responses to its draft environmental review of the project. In December, the agency said it needed to push back releasing that assessment until Feb. 28 as SpaceX worked to respond.\nWrite to Micah Maidenberg at micah.maidenberg@wsj.com", "url": "https://www.foxbusiness.com/markets/elon-musk-expects-starship-to-deliver-launches-at-lower-costs?utm_source=ground.news&utm_medium=referral"}