{
    "id": 4,
    "authors": [],
    "date_publish": "02/02/2021",
    "description": "The US president is to send troops to Poland and Romania amid fears of a Russian invasion of Ukraine.",
    "filename": "https%3A%2F%2Fwww.bbc.com%2Fnews%2Fworld-europe-60234377%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "politics"
    ],
    "source_domain": "www.bbc.com",
    "leaning": 3,
    "title": "Ukraine tensions: US boosts troops in Europe",
    "maintext": "US President Joe Biden is to send extra troops to Europe this week amid continuing fears of a Russian invasion of Ukraine, the Pentagon says.\n Some 2,000 troops will be sent from Fort Bragg, North Carolina, to Poland and Germany, and a further 1,000 already in Germany will go to Romania.\n Moscow denies planning to invade but has deployed an estimated 100,000 troops near Ukraine's borders. It called the US deployment \"destructive\".\n The tensions come eight years after Russia annexed Ukraine’s southern Crimea peninsula and backed a bloody rebellion in the eastern Donbas region.\n Moscow accuses the Ukrainian government of failing to implement the Minsk agreement - an international deal to restore peace to the east, where Russian-backed rebels control swathes of territory and at least 14,000 people have been killed since 2014. \n The US troops being deployed will not fight in Ukraine but will ensure the defence of US allies.\n Their deployment is in addition to the 8,500 troops the Pentagon put on alert last month to be ready to deploy to Europe if needed. \n \"It’s important that we send a strong signal to Mr Putin and, frankly, to the world that Nato matters to the United States and it matters to our allies,\" Pentagon spokesman John Kirby told reporters.\n But on the question of alleged invasion plans by Mr Putin, he said: \"We still don't believe he's made a decision to further invade Ukraine.\" \n He also said that a US proposal \"leaked to a European news outlet\" was genuine. He appeared to be referring to a story in Spain's El País newspaper about a US offer of talks with Russia on cutting back on nuclear weaponry and trust-building measures in exchange for reducing tensions over Ukraine. \n Russian Deputy Foreign Minister Alexander Grushko described the US deployment as a \"destructive\" step which heightened tension and reduced the scope for a political solution. \n Russian President Vladimir Putin discussed Ukraine with UK Prime Minister Boris Johnson by phone on Wednesday. \n Mr Johnson told Mr Putin \"all European democracies have a right to aspire to Nato membership\", a Downing Street statement said. Russia opposes Ukraine joining the security alliance. \n Mr Putin drew attention to Ukraine's \"chronic sabotage\" of the Minsk peace agreements and Nato's reluctance to respond appropriately to Russia's justified concerns\", the Kremlin said in a statement (in Russian). \n The Russian president has accused the US of trying to draw his country into a war in Ukraine. \n He said America's goal was to use a confrontation as a pretext to impose more sanctions on Russia.",
    "url": "https://www.bbc.com/news/world-europe-60234377?utm_source=ground.news&utm_medium=referral"
}