{"id": 2, "authors": ["Shannon Bream"], "date_publish": "03/25/2022", "description": "The Supreme Court has temporarily granted the Pentagon’s request to limit the deployment of unvaccinated active U.S. military members who refused to get COVID shots based on religious grounds.", "filename": "https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Fsupreme-court-allows-pentagon-to-limit-deployment-of-unvaccinated-service-members%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.foxnews.com", "leaning": 5, "title": "Supreme Court allows Pentagon to limit deployment of unvaccinated service members", "maintext": "The Supreme Court has temporarily granted the Pentagon’s request to limit the deployment of unvaccinated active U.S. military members who refused to get COVID shots based on religious grounds.\nAt issue is whether the U.S. Navy has discretion to limit deployment of unvaccinated people. The original lawsuit was brought by a group of 35 Navy SEALs and other Navy Special Warfare personnel. A lower court had granted a preliminary injunction to block the Pentagon from enforcing its vaccination policy.\nJustices Thomas, Alito, and Gorsuch dissented from the order granting a partial stay.\nThe Court order is temporary in nature until the issue is fully litigated in the lower courts.\nMike Berry, director of military affairs for First Liberty Institute which is representing the SEALs said: \"The Court’s narrow partial stay will not deter our mission to ensure America's service members do not lose their religious freedom. As Justice Alito said, this is a ‘great injustice.’\"\nJustice Brett Kavanaugh wrote a concurrence on why he supported the Pentagon request:\n\"I concur in the Court’s decision to grant the Government’s application for a partial stay of the District Court’s prelim­inary injunction for a simple overarching reason: Under Ar­ticle II of the Constitution, the President of the United States, not any federal judge, is the Commander in Chief of the Armed Forces. In light of that bedrock constitutional principle, \"courts traditionally have been reluctant to in­trude upon the authority of the Executive in military and national security affairs.\"\n\"In sum, I see no basis in this case for employing the judi­cial power in a manner that military commanders believe would impair the military of the United States as it defends the American people.\"\nJustice Samuel Alito strongly dissented:\n\"By rubber stamping the Government’s request for what it calls a \"partial stay,\" the Court does a great injustice to the 35 respondents—Navy Seals and others in the Naval Spe­cial Warfare community—who have volunteered to under­take demanding and hazardous duties to defend our coun­try. These individuals appear to have been treated shabbily by the Navy, and the Court brushes all that aside. I would not do so, and I therefore dissent.\"", "url": "https://www.foxnews.com/politics/supreme-court-allows-pentagon-to-limit-deployment-of-unvaccinated-service-members?utm_source=ground.news&utm_medium=referral"}
