{
    "id": "0",
    "authors": ["Jef Feeley"],
    "date_publish": "02/02/22",
    "description": null,
    "filename": "https%3A%2F%2Fwww.bloomberg.com%2Fnews%2Farticles%2F2022-02-01%2Fopioid-distributors-j-j-to-pay-590-million-to-end-tribe-claims%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "coronavirus"
    ],
    "source_domain": "www.bloomberg.com",
    "leaning": 2,
    "title": "Johnson & Johnson, Opioid Distributors to Pay $590 Million to End Tribe Claims",
    "maintext": "Johnson & Johnson and the three largest U.S. drug distributors agreed to pay about $590 million to more than 400 Native American tribes to settle lawsuits over the opioid epidemic. \n McKesson Corp., Cardinal Health Inc. and AmerisourceBergen Corp. will pay $440 million over seven years and J&J will pay $150 million over two years, according to documents filed in federal court on Tuesday. It's the biggest opioid settlement so far with the tribes, who were among thousands of communities that claimed drug makers, distributors and pharmacies helped fuel abuse of the addictive painkillers. \n U.S. District Judge Dan Polster, who is overseeing all opioid litigation in federal courts, helped to broker the tribes' agreement, which is being presented to him Tuesday in Cleveland. The deal was negotiated by a group that represents about 85% of all tribal citizens in the U.S., court records show. \n The Native American population has suffered some of the worst consequences of the opioid epidemic of any population in the United States, which has imposed severe financial burdens on tribal governments to cover increased spending on “health care, social services, child welfare, law enforcement and other government services, attorneys for the tribes said in the filing.\n More than a dozen companies involved in opioids -- including manufacturers, distributors and pharmacies -- are facing almost 4,000 suits filed by states, local governments and tribal leaders. The lawsuits seek compensation for billions of tax dollars spent battling the opioid epidemic, which has claimed almost 500,000 lives in the U.S. over the past two decades.\n The deal with the tribes will expedite the flow of resources to communities impacted by the crisis while enabling AmerisourceBergen to focus on ensuring the pharmaceutical-supply chain is meeting the needs of health-care providers and patients, Gabe Weissman, a company spokesman, said in an emailed statement.\n This settlement is not an admission of any liability or wrongdoing and the Company will continue to defend against any litigation that the final agreement does not resolve,” Alison Fennell, a J&J spokeswoman, said in an emailed agreement.\n Cardinal Health declined to comment, while McKesson didn't immediately return emails seeking comment.\n Most of the claims against the industry are still pending, though a few have been settled recently. J&J and the three distributors, who were accused of failing to properly monitor opioid shipments linked to addictions and fatal overdoses, are offering to pay a combined $26 billion to resolve all outstanding litigation. The agreement with the tribes would be part of that larger offer, which hasn't yet been finalized. \n In September, the distributors agreed to a separate $75 million deal with the Oklahoma-based Cherokee Nation, which still has an opioid lawsuit pending against pharmacy operators including Walmart Inc., CVS Health Corp. and Walgreens Boots Alliance Inc. \n The Centers for Disease Control and Prevention found Native Americans had the highest rates of fatal overdoses tied to opioids between 1999 and 2015, despite making up less than 2% of the U.S. population. For example, research shows that in Washington state, Native Americans died of drug overdoses at more than twice the rate of Whites and Blacks.\n According to Tuesday's court filing, federally-recognized Native American tribes in the U.S. are eligible to claim settlement monies under the deal even if they haven't already filed suit, and each will get to decide whether they want to participate in the deal. So far, more than 400 tribes have sued opioid makers, distributors or retailers, court documents show.\n Mediators helped facilitate the deal, records show. Special Master David Cohen, who is assisting Polster with the consolidated opioid litigation in Cleveland, brought the tribes and J&J together while retired U.S. District Judge Layn Phillips did the same with the distributors.\n In addition to the cash from J&J and the distributors, the tribes are expected to get as much as $150 million as part of Purdue Pharma LP's opioid settlement linked to its bankruptcy, public court filings show. The money is expected to be paid out over almost a decade once Purdue's Chapter 11 plan is approved.\n Purdue's plan hit a roadblock last month when a federal judge struck down a key provision providing members of the Sackler family -- Purdue's owners -- broad legal protections from opioid-related civil lawsuits. That ruling is being appealed.",
    "url": "https://www.bloomberg.com/news/articles/2022-02-01/opioid-distributors-j-j-to-pay-590-million-to-end-tribe-claims"
}