{"id": 8, "authors": ["Ronn Blitzer"], "date_publish": "03/22/2022", "description": "Judge Ketanji Brown Jackson was quick to address questions about her record brought up by Republicans during her Supreme Court confirmation hearing Tuesday, including accusations that she has gone easy on defendants in child pornography cases.", "filename": "https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Fketanji-brown-jackson-responds-hawley-child-porn-comments-nothing-could-be-further-from-the-truth%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.foxnews.com", "leaning": 5, "title": "Ketanji Brown Jackson responds to Hawley child porn comments: 'Nothing could be further from the truth'", "maintext": "Judge Ketanji Brown Jackson was quick to address questions about her record brought up by Republicans during her Supreme Court confirmation hearing Tuesday, including accusations that she has gone easy on defendants in child pornography cases.\nThe issue had been brought up by Sen. Josh Hawley, R-Mo., during the first day of the hearing on Monday, with the senator informed Brown that he would be asking her about certain cases in which she imposed sentences below federal guidelines, accusing her of being soft on child pornography offenders.\n\"As a mother and a judge who has had to deal with these cases, I was thinking that nothing could be further from the truth,\" Jackson said Tuesday, noting that \"[t]hese are some of the most difficult cases that a judge has to deal with\" as they involve pictures of the abuse of children and how judges must read \"graphic descriptions\" during sentencing.\nAs far as the sentences themselves, Jackson said that \"there's a statute that tells judges what they're supposed to do.\" She went on to say that according to the statute, judges are not supposed to do whatever the sentencing guidelines say\n\"That statute doesn't say look only at the guidelines and stop, the statute doesn't say impose the highest possible penalty for this sickening and egregious crime,\" Jackson said. \"The statute says calculate the guidelines, but also look at various aspects of this offense and impose a sentence that is, quote, sufficient, but not greater than necessary to promote the purposes of punishment.\"\nJackson specifically said that in such cases she makes sure that a child's voice is \"represented\" in her sentencing. She explained that in the many cases where a defendant may claim that their offenses were not so severe because they only viewed material and did not produce it, she tells them about victim statements she has received.\n\"I tell them about the adults who were former child sex abuse victims who tell me that they will never have a normal adult relationship because of this abuse. I tell them about the ones who say I went into prostitution, I fell into drugs because I was trying to suppress the hurt that was done to me as an infant,\" Jackson said. She then recalled one case she tells defendants about, where a victim said that \"she has developed agoraphobia, she cannot leave her house because she thinks that everyone she meets will have seen her, will have seen her pictures on the Internet.\"\n\"I tell that story to every child porn defendant as a part of my sentencings so that they understand what they have done,\" Jackson added. \"I say to them that there's only a market for this kind of material because there are lookers. That you are contributing to child sex abuse. And then I impose a significant sentence and all of the additional restraints that are available in the law. These people are looking at 20, 30, 40 years of supervision. They can't use their computers in a normal way for decades. I am imposing all of those constraints because I understand how significant, how damaging, how horrible this crime is.\"Hawley's office immediately responded to Jackson on Twitter.\n\"FACT CHECK: In the case of U.S. v. Driscoll, Missouri judge Sarah Pitlyk imposed the exact sentence—60 months—the government intended to seek. By contrast, Judge Jackson went below the government’s recommendation every time she could,\" Hawley's press team tweeted. \"There’s no comparison.\"", "url": "https://www.foxnews.com/politics/ketanji-brown-jackson-responds-hawley-child-porn-comments-nothing-could-be-further-from-the-truth?utm_source=ground.news&utm_medium=referral"}