{
    "id": 7,
    "authors": [],
    "date_publish": "02/02/2021",
    "description": "Manchester United forward Mason Greenwood has been released on bail after being questioned over the alleged rape and assault of a young woman.",
    "filename": "https%3A%2F%2Fwww.news24.com%2Fsport%2FSoccer%2FEnglishPremiership%2Fman-uniteds-mason-greenwood-released-on-bail-after-arrest-20220202%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "sports"
    ],
    "source_domain": "www.independent.co.uk",
    "leaning": 4,
    "title": "Mason Greenwood: Manchester United striker bailed after being arrested over rape claim",
    "maintext": "Mason Greenwood has been released on bail pending further investigation following his arrest on suspicion of rape and assault.\n Greenwood was arrested on Sunday after a woman posted photographs of injuries and the audio of an apparent sexual assault on social media. The posts have since been deleted.\n The Manchester United striker was further arrested on suspicion of sexual assault and threats to kill after police were granted an additional two days for questioning.\n United have announced that Greenwood will not play or train with the club until further notice, while removing links to purchase merchandise featuring his name from their online store.\n A statement by Greater Manchester Police read: \"A 20 year old man arrested (on Sunday 30 January 2022) on suspicion of the rape and assault of a woman has been released on bail pending further investigation.\"\nIn light of Greenwood's re-arrest on Tuesday, United said in a club statement: \"Manchester United reiterates its strong condemnation of violence of any kind.\"\n As previously communicated, Mason Greenwood will not train with, or play for, the club until further notice. \n Greenwood is under contract with the Old Trafford club until 2025.\nThe 20-year-old has been removed from the FIFA 22 game by EA Sports in light of the allegations, while sponsors Nike have also suspended their relationship.",
    "url": "https://www.independent.co.uk/sport/football/mason-greenwood-bail-police-man-united-b2005835.html"
}