{
    "id": 2,
    "authors": [
        ""
    ],
    "date_publish": "02/02/2021",
    "description": "Native American tribes reached a settlement of $590 with Johnson & Johnson",
    "filename": "",
    "image_url": null,
    "topic": [
        "coronavirus"
    ],
    "source_domain": "www.foxnews.com",
    "leaning": 5,
    "title": "Native American tribes reach $590M settlement over opioids",
    "maintext": "Native American tribes in the U.S. have reached settlements over the toll of opioids totaling $590 million with drugmaker Johnson & Johnson and the country's three largest drug distribution companies, according to a court filing made Tuesday. \n The filing in U.S. District Court in Cleveland lays out the broad terms of the settlements with Johnson & Johnson and distribution companies AmerisourceBergen, based in Conshohocken, Pennsylvania; Cardinal Health, based in Columbus, Ohio; and McKesson, based in Irving, Texas. Some details are still being hashed out.\n All federally recognized tribes will be able to participate in the settlements, even if they did not sue over opioids. Many tribes have been hit hard by the addiction and overdose crisis across the U.S. One study cited in the settlement found that Native Americans have had the highest per capita rate of opioid overdose of any population group in 2015.\n \"American Indians have suffered the highest per capita rate of opioid overdose and are more likely than other group in the United States to die from drug-induced deaths,\" Chairman Douglas Yankton of the Spirit Lake Nation in North Dakota, said in a statement. \"The dollars that will flow to Tribes under this initial settlement will help fund crucial, on-reservation, culturally appropriate opioid treatment services.\" \n More than 400 tribes and intertribal organizations representing about 80% of tribal citizens have sued over opioids. \n Under the deal, New Brunswick, New Jersey based Johnson & Johnson would pay $150 million over two years and the distribution companies would contribute $440 million over seven years. Each tribe could decide whether to participate.\n The tribes would be required to use the money to deal with the opioid epidemic.\n The deal would take effect when 95% of the tribes with lawsuits against the companies agree to the settlement, said Tara Sutton, a lawyer whose firm is representing 28 tribes.\n Sutton said settlements are also in the works between tribes and other companies involved in opioids.\n The newly announced deals are separate from a $75 million one the Cherokee Nation and the three distribution companies reached last year ahead of a trial.",
    "url": "https://www.foxnews.com/us/native-american-tribes-settlement-opioids"
}