{"id": "7", "authors": ["Abc News", "Seth Borenstein Ap Science Writer", "November"], "date_publish": "11/14/21", "description": "While world leaders hail the Glasgow climate pact as a good compromise that keeps a key temperature limit alive, scientists are much more skeptical", "filename": "https%3A%2F%2Fabcnews.go.com%2FTechnology%2FwireStory%2Fscientists-skeptical-alive-15-temperature-limit-81167915.json", "image_url": null, "topic": ["climate"], "source_domain": "abcnews.go.com", "leaning": 2, "title": "'Watered-down hope': Experts wanted more from climate pact", "maintext": "While world leaders hail the Glasgow climate pact as a good compromise that keeps a key temperature limit alive, scientists are much more skeptical\nGLASGOW, Scotland -- While world leaders and negotiators are hailing the Glasgow climate pact as a good compromise that keeps a key temperature limit alive, many scientists are wondering what planet these leaders are looking at.\nCrunching the numbers they see a quite different and warmer Earth.\n“In the bigger picture I think, yes, we have a good plan to keep the 1.5-degree goal within our possibilities,” United Nations climate chief Patricia Espinosa told The Associated Press, referring to the overarching global goal of limiting warming to 1.5 degrees Celsius (2.7 degrees Fahrenheit) since pre-industrial times.\nUnited Kingdom Prime Minister Boris Johnson, the conference host, agreed, calling the deal a “clear road map limiting the rise in global temperatures to 1.5 degrees.”\nBut many scientists are far more skeptical. Forget 1.5 degrees, they say. Earth is still on a path to exceed 2 degrees (3.6 Fahrenheit).\n“The 1.5C goal was already on life support before Glasgow and now it’s about time to declare it dead,” Princeton University climate scientist Michael Oppenheim told The Associated Press in an email Sunday.\nA few of the 13 scientists the AP interviewed about the Glasgow pact said they see just enough progress to keep alive the 1.5-degree Celsius limit — and with it, some hope. But barely.\nThe optimists point to many agreements that came out of Glasgow, including a United States-China deal to work harder together to cut emissions this decade, as well as separate multi-nation agreements that target methane emissions and coal-fired power. After six years of failure, a market-based mechanism would kick-start trading credits that reduce carbon in the air.\nThe 1.5-degree mark is the more stringent of two targets from the historic 2015 Paris climate accord. United Nations officials and scientists consider it key because a 2018 scientific report found dramatically worse effects on the world after 1.5 degrees.\nThe world has already warmed 1.1 degrees (2 degrees Fahrenheit) since pre-industrial time, so this is really about a few tenths of a degree more. The United Nations calculated that to limit warming to 1.5 degrees, countries need to cut their emissions in half by 2030. Emissions are now going up, not down, by about 14% since 2010, Espinosa said.\nGerman researcher Hans-Otto Portner said the Glasgow conference “got work done, but did not make enough progress.\"\n\"Warming will by far exceed 2 degrees Celsius. This development threatens nature, human life, livelihoods, habitats and also prosperity,” said Portner, who co-chairs one of the Intergovernmental Panel on Climate Change scientific reports the United Nations relies on.\nInstead of big changes in bending the temperature curve as the United Nations had hoped for from Glasgow, they got only tiny tweaks, according to scientists who run computer simulations.\n“Heading out of Glasgow we have shaved maybe 0.1C off of warming ... for a best-estimate of 2.3C warming,\" Breakthrough Institute climate scientist and director Zeke Hausfather said in an email. Hausfather has done climate modeling with colleagues for Carbon Brief.\nMIT professor Jon Sterman said his Climate Interactive team crunched some preliminary numbers after the Glasgow deal came out and it didn’t match leaders’ optimism.\n“There is no plausible way to limit warming to 1.5 or even 2 (degrees) if coal is not phased out ... and as rapidly as possible, along with oil and gas,” he said.\nOn Saturday, India got a last-minute change to the pact: Instead of the “phase out” of coal and fossil fuel subsidies, the subsidies are to be “phased down.” Several of the scientists said that regardless of what the deal says, coal needs to end, not just decrease, to lessen future warming.\n“‘Lessening’ will do less to slow the harmful effects of climate change than ‘eliminating,’” former NASA chief scientist Waleed Abdalati, who runs environmental research at the University of Colorado, said in an email.\nBefore the pact was finished, Climate Action Tracker, which also analyzes pledges to see how much warming they would lead to, said emission-cut pledges would lead to 2.4 degrees of warming.\nThe 1.5 figure “is balanced on a knife edge,” said tracker scientist Bill Hare of Australia.\nOne paragraph in the pact — which calls on countries whose emission-cutting goals aren’t in line with 1.5- or 2- degree limits to come back with new stronger goals by the end of next year — gives hope, Hare said.\nBut U.S. climate envoy John Kerry said Saturday night that paragraph probably doesn’t apply to the United States, the second-largest coal emitter and the largest historically, because the U.S. goal is so strong.\nJonathan Overpeck, a climate scientist who is dean of the University of Michigan’s environment school said the pact provided “watered down hope. ... We got an incomplete plan for slower action.”\n“I went into the (conference) thinking 1.5C was still alive, and it appears the world’s leaders just didn’t have the backbone for that,” Overpeck said in an email.\nSome progress was made, said University of Illinois climate scientist Donald Wuebbles, one of the key authors of the U.S. national climate assessment. “But the probability of getting to 1.5 degrees is much reduced, even to the point of almost being impossible. Even being able to get to 2 degrees is less likely.”\nBut some scientists held out hope.\n“For the first time, I can really see a potential path forward to limiting warming to 1.5C,” Pennsylvania State University climate scientist Michael Mann said in an email. “But it will require both (a) countries making good on their current pledges and (b) further ratcheting up their current commitments.”\nJohan Rockström of the Potsdam Institute for Climate Impact and Research in Germany highlighted the “optimistic” scenario he and a few others see if all the countries that have promised net-zero emissions by mid-century actually achieve the goal — something most haven’t started concrete action on.\nIn that case, warming could be limited to 1.8 degrees or 1.9 degrees, Rockström said.\n“That is a significant progress, but far from sufficient,” he said.\n———\nFollow AP’s climate coverage at https://apnews.com/hub/climate\n———\nFollow Seth Borenstein on Twitter at @borenbears\n———\nThe Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/scientists-skeptical-alive-15-temperature-limit-81167915"}