{"id": 5, "authors": ["Brooke Singman"], "date_publish": "04/28/2022", "description": "President Biden on Thursday is requesting $33 billion from Congress for additional security, military and humanitarian assistance for Ukraine and for U.S. efforts to strengthen European security in cooperation with NATO allies and partners", "filename": "https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Fbiden-ukraine-security-assistance-request-33-billion-congress%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.foxnews.com", "leaning": 5, "title": "President Biden on Thursday requested $33 billion from Congress for additional security, military and humanitarian assistance for Ukraine and for U.S. efforts to strengthen European security in cooperation with NATO allies and partners.\n\"I just signed a request to Congress for critical security, economic humanitarian assistance to help Ukraine continue to counter Putin's aggression,\" the president said from the White House Thursday. \"And at a very pivotal moment, we need this bill to support Ukraine in its fight for freedom and our NATO allies, our EU partners, they're going to pay their fair share the costs as well.\"\nHe added: \"But we have to do this. We have to do our part as well leading the alliance.\"\nThe president said that \"the cost of this fight, it's not cheap, but caving new aggression is going to be more costly.\"\n\"We either back Ukrainian people as they defend their country or we stand by as the Russians continue their atrocities and aggression in Ukraine,\" Biden said. \"Every day, every day, the Ukrainians pay the price and the price they pay with their lives for this fight, so we need to contribute arms funding, ammunition and the economic support to make their courage and sacrifice have purpose so they can continue this fight and do what are doing.\"\nThe president said it is \"critical this funding gets approved and approved as quickly as possible.\"\nBiden said that even before Russia's invasion of Ukraine, he \"made clear how the United States would respond.\"\n\"We said we not send U.S. troops to fight Russian troops in Ukraine, but we would provide robust military assistance and try to unify the Western world against Russia's aggression,\" Biden said. \"I said I would impose powerful sanctions on Russia and that we destroy and develop, we destroy this myth that somehow they can continue to move without the rest of the world, that we deploy additional forces to defend NATO territory, particularly in the east, along the Russian and Belarus borders.\"\n\"That's exactly--It's exactly what we said we would do and we did,\" Biden said. \"But despite the disturbing rhetoric coming out of the Kremlin, the facts are playing for everybody to see.\"\nHe added: \"We're not attacking Russia. We're helping Ukraine defend itself against Russian aggression,\" he said. \"And just as Putin chose to launch this brutal invasion, he could make the choice to end this brutal invasion.\"\nHe added: \"Russia is the aggressor. No ifs, ands or buts about it. Russia is the aggressor and the world must and will hold Russia accountable.\"\nThe president said that \"as long as the assaults and atrocities continue, we're going to continue to supply military assistance.\"\nThe Biden administration is calling for $20.4 billion in additional security assistance for Ukraine, including $5 billion in additional drawdown authority, $6 billion for the Ukraine Security Assistance Initiative, and $4 billion for the State Department’s Foreign Military Financing program.\nThat funding would provide additional artillery, armored vehicles, anti-armor and anti-air capabilities; accelerated cyber capabilities and advanced air defense systems; assistance to clear landmines, improvised explosive devices and other explosive remnants of war in order to address threats related to chemical, biological, radiological and nuclear materials; and put NATO at a \"stronger\" security posture.\nWith regard to economic aid, the administration is calling for $8.5 billion in assistance for Ukraine to address and respond to the \"immediate crisis\" and help to provide \"basic citizen services,\" including funds to ensure Ukraine’s democratic government continues functioning; to ensure they can provide food, energy and health care to the Ukrainian people; counter Russian disinformation and propaganda narratives; and to support businesses during the fall harvest and for \"natural gas purchases\" by the Ukrainian state energy company in order to address needs in Ukraine.\n\"These resources will put urgently needed equipment into the hands of Ukraine’s military and police, as well as help NATO deter and defend against Russian aggression over the long-term,\" an administration official said Thursday.\nAccording to an administration official, the $3 billion in additional humanitarian assistance will provide \"critical resources\" to address food security needs around the globe and will help to purchase high thermal blankets, medical supplies, emergency health kits, safe drinking water and shelter materials for Ukrainians displaced by the war.\nThe funding would also go toward job training, trauma-informed mental health services and resources for local school districts to support Ukrainians arriving in the United States.\nThe administration is also asking for funding to bolster the Justice Department’s \"KleptoCapture Task Force\" efforts to pursue high value asset seizures from sanctioned individuals related to Russian actions in Ukraine.\nBiden is also calling for an additional $500 million in domestic food production assistance to support U.S. food crops that are \"experiencing a global shortage due to the war in Ukraine,\" like wheat and soybeans.\n\"Additional funding will also allow use of the Defense Production Act to expand domestic production of critical minerals and materials that have been disrupted by Putin’s war in Ukraine and that are necessary to make everything from defense systems to automobiles,\" an official said.\n\"This will help address economic disruptions and reduce price pressures at home and around the world,\" the official said.\n\"America and our allies must continue to deliver,\" an official said. \"Today, the president will speak about the critical resources required for the United States to maintain our high level assistance over the months to come.\"\nThe official said the president's funding request is \"what we believe is needed to enable Ukraine's success over the next five months of this war.\"\n\"And we have every expectation that our partners and allies, particularly those of the G7, as well as many other countries, will continue to provide comparable levels of assistance going forward. so that each of us is doing our part,\" an official said.\n\"This war will not end easily or rapidly, but the free world is united against this brutal invasion, and we must continue to be in the best position possible to respond to a variety of scenarios,\" the official continued. \"President Biden will call on Congress to keep this up.\"\nThe emergency supplemental funding request comes after the Biden administration, last week, announced another $800 million in military aid for Ukraine , including heavy artillery and ammunition, as the country continues to fight to defend itself against Russia’s multi-front war. That funding was in addition to an authorization of $800 million in weapons, ammunition and other security assistance earlier this month.\nThat $1.6 billion the president approved this month for Ukraine came in addition to the more than $1 billion the Biden administration already sent to Ukraine.", "url": "https://www.foxnews.com/politics/biden-ukraine-security-assistance-request-33-billion-congress?utm_source=ground.news&utm_medium=referral"}