{"id": 8, "authors": [], "date_publish": "03/25/2022", "description": "The head of the Russian parliamentary committee on energy Pavel Zavalny on Thursday said that Russia is considering accepting bitcoin as payment along with fiat currencies as payment for its oil and gas exports. Russia’s Duma committee on energy said that the ruble and bitcoin were considered as alternative ways to pay for Russia’s energy exports. Zavalny said that Russia is willing to be more flexible with payment options with friendly nations - pointing to China and Turkey, news agency reported.", "filename": "https%3A%2F%2Fwww.news18.com%2Fnews%2Fworld%2Frussia-may-accept-bitcoin-for-oil-gas-exports-to-mitigate-damage-caused-by-sanctions-4906208.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["tech"], "source_domain": "www.news18.com", "leaning": 4, "title": "Russia May Accept Bitcoin For Oil, Gas Exports To Mitigate Damage Caused By Sanctions", "maintext": "The head of the Russian parliamentary committee on energy Pavel Zavalny on Thursday said that Russia is considering accepting bitcoin as payment along with fiat currencies as payment for its oil and gas exports.\nRussia’s Duma committee on energy said that the ruble and bitcoin were considered as alternative ways to pay for Russia’s energy exports. Zavalny said that Russia is willing to be more flexible with payment options with friendly nations - pointing to China and Turkey, news agency CNBC reported.\n“We have been proposing to China for a long time to switch to settlements in national currencies for rubles and yuan. With Turkey, it will be lira and rubles,” Zavalny was quoted as saying by CNBC.\n“You can also trade bitcoins. If they want to buy, let them pay either in hard currency, and this is gold for us, or pay as it is convenient for us, this is the national currency,” Zavalny then went on to add.\nFollowing this announcement, Bitcoin prices soared over the last 24 hours to 4% climbing up to $44,000 and its price soared around the time reports of Zavalny’s announcement surfaced.\nThe Duma committee also reiterated Russian president Vladimir Putin’s desire to make ‘unfriendly’ nations pay for gas in Russia’s currency. Following Putin’s announcement on Wednesday, prices of oil soared all over Europe causing further uncertainty in an already-stressed energy market.\nThe European Union (EU) is uncertain whether it will stop importing Russian oil in response to the Russian invasion of Ukraine. Much of western Europe depends on Russian energy exports especially during winter due to extreme cold. People familiar with the developments told news agency CNBC that unlike the United States (US) the European Union may not ban importing Russian oil.\nNic Carter, a founding partner of Castle Island Ventures, an early-stage firm focused on cryptocurrency and the co-founder of Coin Metrics said that Russia appears to be serious from moving away from the dollar and it was preparing for that kind of transition since 2014 when it began divesting in US Treasurys. Putin once in 2021 said that he was not convinced that bitcoin could replace the US dollar in settling oil trades. But the Kremlin is now considering it as a form of payment for major exports.", "url": "https://www.news18.com/news/world/russia-may-accept-bitcoin-for-oil-gas-exports-to-mitigate-damage-caused-by-sanctions-4906208.html?utm_source=ground.news&utm_medium=referral"}
