{"id": 6, "authors": ["Maria Jimenez Moya"], "date_publish": "03/25/2022", "description": "Russia may accept bitcoin as a form of payment for its energy exports of oil and gas.", "filename": "https%3A%2F%2Fwww.usatoday.com%2Fstory%2Fnews%2Fworld%2F2022%2F03%2F25%2Frussia-bitcoin-payment-oil%2F7165901001%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["tech"], "source_domain": "www.usatoday.com", "leaning": 2, "title": "Russia may be accepting bitcoin as payment for oil and gas", "maintext": "Russia may accept bitcoin as a form of payment for its energy exports of oil and gas, the head of the country's energy committee announced Thursday.\nThe move is part of the country's bid to decrease the use of the euro and dollar and substitute it with its own ruble and national currencies of its ally countries such as China and Turkey.\nThe committee leader, Pavel Zavalny, made the televised announcement, saying the decision was made as a reaction to the sanctions that Russia is facing due to the war on Ukraine.\nZalvany indicated that Western countries still importing oil and gas from Russia will have to pay rubles or gold. This also includes European countries that are not allied with Russia.\nZalvany's comments were a proposal and are not a confirmed action.\n\"The set of currencies may vary, and that’s normal practice. If there are bitcoins – we will trade in bitcoins,\" said Zalvany.\nThe announcement resulted in climbing gas prices in Europe as buyersaround the world have opted out of consuming Russian oil as a way to sanction the country.\nZalvany said that all the contracts they have will still be in place, and nothing changes in their obligations. However, if they do not pay with the accepted currency, then Russia will not supply oil.\n“Gas is just the beginning, this will also affect other resources. If they want to buy, let them pay either in hard currency, for us that’s gold, or in currencies that are convenient for us, that’s the national currency,” Zalvany said.", "url": "https://www.usatoday.com/story/news/world/2022/03/25/russia-bitcoin-payment-oil/7165901001/?utm_source=ground.news&utm_medium=referral"}
