{"id": 1, "authors": ["Alina Selyukh"], "date_publish": "03/22/2022", "description": "The ruling amounts to an immediate ban of Facebook and Instagram in Russia, where both platforms are already blocked. WhatsApp, which is owned by the same company, is still allowed.", "filename": "https%3A%2F%2Fwww.npr.org%2F2022%2F03%2F21%2F1087827003%2Ffacebook-instagram-russia-extremist-organization%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["technology"], "source_domain": "www.npr.org", "leaning": 3, "title": "A Russian court bans Facebook and Instagram as extremist", "maintext": "A Russian court bans Facebook and Instagram as extremist\nEnlarge this image toggle caption Kirill Kudryavtsev /AFP via Getty Images Kirill Kudryavtsev /AFP via Getty Images\nA Russian court has banned Meta, the parent company of Facebook and Instagram, for \"extremist\" activities, making its work in Russia illegal. The decision excludes WhatsApp, which Meta also owns.\nThe ruling immediately bans Facebook and Instagram from Russia, where both platforms are already blocked. Russian authorities are also seeking to designate Meta an \"extremist organization,\" which could go into effect after a potential appeal by Meta. The company did not immediately comment.\nFor now, the full scope of the ruling's impact remains unclear. An extremist designation in Russia typically outlaws any commercial activity or even the display of brand symbols. In the hearing, government prosecutors appeared to specify that regular people using Facebook or Instagram would not face prosecution.\nThe case stems in part from Meta's decision earlier this month to permit some calls for violence against Russian soldiers. Russian prosecutors' criminal probe cited \"illegal calls for the murder of Russian nationals\" by Meta employees and accused Instagram of serving as a platform for organizing \"riots, accompanied by violence.\"\nMeta later clarified to say it relaxed its rules against violent speech only for people inside Ukraine and only directed at Russian military in that country. It does not permit any calls for violence, harassment or discrimination against Russian people.\nIn recent years, Russian authorities have expanded the extremist designation beyond terrorist groups like al-Qaida to include Jehovah's Witnesses, the political movement of jailed opposition leader Alexei Navalny, and other organizations.\nMore Russians have begun using virtual private networks, or VPNs, to get around government restrictions on social media. Demand for VPNs in Russia was 2,692% higher on March 14 than before the fighting began, according to Top10VPN, a privacy monitoring service.\nMore than 15,000 Russian protesters have been arrested in the past three weeks as new laws have criminalized public statements about Ukraine that do not align with the Kremlin's official view of what it calls the \"special military operation.", "url": "https://www.npr.org/2022/03/21/1087827003/facebook-instagram-russia-extremist-organization?utm_source=ground.news&utm_medium=referral"}