{
    "id": "6",
    "authors": [
    ],
    "date_publish": "02/02/2021",
    "description": "The 20-year-old forward was arrested initially on Sunday on suspicion of rape and assault after police said they became “aware of online social media images and videos posted by a woman reporting incidents of physical violence.”",
    "filename": "https%3A%2F%2Findianexpress.com%2Farticle%2Fsports%2Ffootball%2Fman-us-greenwood-questioned-on-suspicion-of-threats-to-kill-7752197%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "sports"
    ],
    "source_domain": "indianexpress.com",
    "leaning": 2,
    "title": "Man United player Mason Greenwood released on bail",
    "maintext": "Manchester United player Mason Greenwood was released on bail Wednesday by police who questioned him on suspicion of the rape and assault of a woman.\nThe 20-year-old forward, who had been in custody since being arrested on Sunday, has been “released on bail pending further investigation,” Greater Manchester Police said.\nUnited has said Greenwood “will not train with, or play for, the club until further notice.”\nGreenwood had remained in police custody on Tuesday as officers investigating an attack on a woman also started to question him on suspicion of sexual assault and threats to kill.\nThe 20-year-old forward was arrested initially on Sunday on suspicion of rape and assault after police said they became “aware of online social media images and videos posted by a woman reporting incidents of physical violence.”\nA court granted police until Wednesday to continue holding Greenwood, who has not been charged and is now being questioned over further allegations.\n“Following enquiries so far, he has since been further arrested on suspicion of sexual assault and threats to kill,” Greater Manchester Police said. \nGreenwood, who has six goals this season, is under contract with United through 2025 but the club distanced itself from him on Sunday.\n“Manchester United reiterates its strong condemnation of violence of any kind,” the club said Tuesday. “As previously communicated, Mason Greenwood will not train with, or play for, the club until further notice.”\nGreenwood has been removed from the active squads in the FIFA 22 video game, Electronic Arts said.\nThere has been no comment from Greenwood or his representatives.",
    "url": "https://indianexpress.com/article/sports/football/man-us-greenwood-questioned-on-suspicion-of-threats-to-kill-7752197/?utm_source=ground.news&utm_medium=referral"
}