{
    "id": "1",
    "authors": [
        "The Associated Press"
    ],
    "date_publish": "10/18/21",
    "description": "Facebook posted on Sunday that the high-skilled workers will help build \"the metaverse,\" a futuristic notion for connecting people online. The social network isn't the only one working on the concept.",
    "filename": "https%3A%2F%2Fwww.npr.org%2F2021%2F10%2F18%2F1047033994%2Ffacebook-metaverse-10-000-workers-europe-virtual-reality.json",
    "image_url": null,
    "topic": [
        "technology"
    ],
    "source_domain": "www.npr.org",
    "leaning": 3,
    "title": "Facebook will hire 10,000 workers in Europe to build a 'metaverse'",
    "maintext": "LONDON — Facebook said it plans to hire 10,000 workers in the European Union over the next five years to work on a new computing platform that promises to connect people virtually but could raise concerns about privacy and the social platform gaining more control over people's online lives.\nThe company said in a blog post Sunday that those high-skilled workers will help build \"the metaverse,\" a futuristic notion for connecting online that uses augmented and virtual reality.\nFacebook executives have been touting the metaverse as the next big thing after the mobile internet, though their track record is spotty on predicting future trends. Expectations that CEO Mark Zuckerberg made four years ago of taking virtual vacations with faraway loved ones via a headset or using a smartphone camera to improve an apartment virtually have not materialized so far.\nThe company also is contending with antitrust crackdowns, the testimony of whistleblowing former employees and concerns about how it handles vaccine-related and political misinformation.\n\"As we begin the journey of bringing the metaverse to life, the need for highly specialized engineers is one of Facebook's most pressing priorities,\" according to the blog post from Nick Clegg, vice president of global affairs, and Javier Olivan, vice president of central products.\nFacebook's recruiters are targeting Germany, France, Italy, Spain, Poland, the Netherlands and Ireland for the hiring drive. The company as of June reported having more than 63,000 employees worldwide, up 21% from the same time last year.\nThe metaverse would be accessed by millions using avatars\nThe metaverse essentially is a massive virtual world that can be accessed in real time by millions of people using avatars, who can use it to hold virtual meetings or buy virtual land and clothing or other digital assets, often paying with cryptocurrencies.\nHere & Now 'Honor Bound' Author Amy McGrath Dreams Big; Facebook's 'Metaverse' 'Honor Bound' Author Amy McGrath Dreams Big; Facebook's 'Metaverse' Listen · 42:56 42:56\nThe social network isn't the only one working on the metaverse, and Facebook acknowledged that no single company will own and operate it. Other players include Fortnite maker Epic Games, which has raised $1 billion from investors to help with its long-term plans for building the metaverse.\n\"There's not going to be specific metaverses to specific companies. There's only going to be one metaverse,\" said Tuong Nguyen, an analyst who tracks immersive technologies for research firm Gartner.\nBut there are concerns Facebook and a handful of other Silicon Valley giants would end up monopolizing the metaverse and use it to collect and profit from personal data, mirroring the situation now with the internet.\nFacebook last month announced a $50 million investment to fund global research and partnerships with civil rights groups, nonprofits, governments and universities to develop products responsibly for the metaverse. But the company added that it would probably take 10 to 15 years to \"fully realize\" many of those products.\nThe term metaverse was coined by writer Neal Stephenson for his 1992 science fiction novel Snow Crash but has recently found new life in the tech business world as startups and tech giants try to stake their claim on an emerging trend.\nSome of that involves a \"little bit of metaverse-washing,\" or applying the term to existing initiatives in augmented reality and other technologies to take advantage of the hype around it, Nguyen said.\n\"It will help raise their profile, at least for the moment, as one of the leaders in metaverse initiatives,\" he said of Facebook's latest push. \"But like any big technology trend, there will be competing ideas and competing standards.\"\nA British parliamentary committee is set to hear from 2 Facebook whistleblowers\nIn a separate blog post Sunday, the company defended its approach to combating hate speech, in response to a Wall Street Journal article that examined the company's inability to detect and remove hateful and excessively violent posts.\nA British parliamentary committee that's working on online safety legislation was set to hear from two Facebook whistleblowers. The bill proposes big fines or other penalties for internet companies that don't remove and limit the spread of harmful material such as child sexual abuse or terrorist content.\nSophie Zhang, a data scientist who raised the alarm after finding evidence of online political manipulation in countries such as Honduras and Azerbaijan before she was fired, appeared before the committee Monday. She said social media companies should be required to apply policies consistently, adding that it's not what happened at Facebook.\nFake accounts that weren't directly tied to a political figure were easier to take down than those that weren't, she said.\nThis resulted in a \"perverse effect in that it creates an incentive for major political figures to essentially commit a crime openly,\" Zhang said. She compared it to police taking a year to arrest a burglar who was a member of Parliament and didn't wear a mask.\n\"That's an analogy of what is going on at Facebook,\" Zhang said.\nNext week, the committee will hear from Frances Haugen, who went public with internal Facebook research that she copied before leaving her job earlier this year. Haugen testified before a U.S. Senate panel this month about her accusations Facebook's platforms harm children and incite political violence, and her British appearance will be the start of a tour to meet European lawmakers and regulators.",
    "url": "https://www.npr.org/2021/10/18/1047033994/facebook-metaverse-10-000-workers-europe-virtual-reality"
}