{"id": "6", "authors": ["Kirk Siegler"], "date_publish": "11/14/21", "description": "The newly passed infrastructure bill could lead to a boom in solar production requiring a lot more land, including farmland. But research is showing solar panels might actually help grow some crops.", "filename": "https%3A%2F%2Fwww.npr.org%2F2021%2F11%2F14%2F1054942590%2Fsolar-energy-colorado-garden-farm-land.json", "image_url": null, "topic": ["climate"], "source_domain": "www.npr.org", "leaning": ["neutral"], "title": "This Colorado 'solar garden' is a farm under solar panels : NPR", "maintext": "This Colorado 'solar garden' is literally a farm under solar panels\nEnlarge this image toggle caption Kirk Siegler/NPR Kirk Siegler/NPR\nWhen Byron Kominek returned home after the Peace Corps and later working as a diplomat in Africa, his family's 24-acre farm near Boulder, Colo., was struggling to turn a profit.\n\"Our farm has mainly been hay producing for fifty years,\" Kominek said, on a recent chilly morning, the sun illuminating a dusting of snow on the foothills to his West. \"This is a big change on one of our three pastures.\"\nThat big change is certainly an eye opener: 3,200 solar panels mounted on posts eight feet high above what used to be an alfalfa field on this patch of rolling farmland at the doorstep of the Rocky Mountains.\nGetting to this point, a community solar garden that sells 1.2 megawatts of power back into the local grid wasn't easy, even in a progressive county like his that wanted to expand renewable energy. When Kominek approached Boulder County regulators about putting up solar panels, they initially told him no, his land was designated as historic farmland.\n\"They said, land's for farming, so go farm it,\" Kominek says. \"I said, well, we weren't making any money, you all want to be 100% renewable at some point so how about we work together and sort this out.\"\nThey eventually did, with help from researchers at nearby Colorado State University and the National Renewable Energy Lab, which had been studying how to turn all that otherwise unused land beneath solar panels into a place to grow food.\nWith close to two billion dollars devoted to renewable power in the newly passed infrastructure bill, the solar industry is poised for a win. But there have long been some tensions between renewable developers and some farmers. According to NREL, upwards of two million acres of American farmland could be converted to solar in the next decade.\nBut what if it didn't have to be an either or proposition? What if solar panels and farming could literally co-exist, if not even help one another.\nThat was what piqued Kominek's interest, especially with so many family farms barely hanging on in a world of corporate consolidation and so many older farmers nearing retirement.\ntoggle caption Kirk Siegler/NPR\nLast year, Boulder County updated its land use code. And soon after Kominek installed the solar panels on one of this pastures. They're spaced far enough apart from one another so he could drive his tractor between them.\nStill, when it came time to plant earlier this year, Kominek was initially skeptical.\nBut he soon discovered that the shade from the towering panels above the soil actually helped the plants thrive. That intermittent shade also meant a lot less evaporation of coveted irrigation water. And in turn the evaporation actually helped keep the sun-baked solar panels cooler, making them more efficient.\nBy summer, Kominek was a believer.\nWalking the intricately lined rows of veggies beneath the panels, he beams pointing out where the peppers, tomatoes, squash, pumpkins, lettuces, beets, turnips, carrots were all recently harvested. The farm is still bursting with chard and kale even in November.\n\"Oh yeah, kale never dies,\" Kominek says, chuckling.\nKominek's farm, rebranded as Jack's Solar Garden (Jack is his grandfather's name), is part of a burgeoning industry known as agrivoltaics. It's a relatively new field of research and Kominek's farm is one of only about a dozen in the United States known to be experimenting with it.\nBut agrivoltaics is drawing particular interest in the West, now in the grips of a 22 year megadrought.\n\"Around the western US, water is the reason to go to war,\" says Greg Barron-Gafford, a University of Arizona professor who is considered one of the country's foremost experts in the field.\n\"Water is the reason we have to have real big arguments about where we're going to get our food from in the future,\" he says.\nBarron-Gafford's research in the Arizona desert showed some crops grown underneath solar panels needed 50% less water. He and other scientists have their eyes on the infrastructure bill and are pushing to get some of the estimated $300 million included in it for new solar projects to go toward agrivoltaics.\n\"If you really want to build infrastructure in a way that is not going to compete with food and could actually take advantage of our dwindling resources in terms of water in a really efficient way, this is something to look at,\" Barron-Gafford says.\nResearchers say there needs to be financial incentives for family farmers to add solar to their portfolio, if solar gardens like Byron Kominek's are really going to take off and become mainstream.\nIn Kominek's case, he literally bet the farm in order to finance the roughly $2 million solar arrays.\n\"We had to put up our farm as collateral as well as the solar array as collateral to the bank,\" he says. \"If this doesn't work, we lose the farm.\"\nBut farming is all about taking on risk and debt, he says. And early on anyway, it's looking like his bet could pay off.\n\"That humming [you hear] is the inverters making us money,\" he says, pointing toward an electric converter box mounted near a row of kale. A series of wires carry the power out to the county highway and onto the local Xcel Energy grid.\nThe inverters here generate enough power for 300 homes to use in a year. Kominek hopes to soon grow enough food beneath the panels to maybe feed as many local families.", "url": "https://www.npr.org/2021/11/14/1054942590/solar-energy-colorado-garden-farm-land"}