{"id": 7, "authors": ["Mackenzie Sigalos"], "date_publish": "03/25/2022", "description": "Russia might accept bitcoin as payment for its oil and gas exports as Western countries stiffen their sanctions on Moscow.", "filename": "https%3A%2F%2Fwww.cnbc.com%2F2022%2F03%2F24%2Frussia-might-take-bitcoin-as-payment-for-oil-and-gas-as-sanctions-rise.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["tech"], "source_domain": "www.cnbc.com", "leaning": 3, "title": "Russia might take bitcoin as payment for oil and gas as sanctions rise", "maintext": "Faced with stiffening sanctions from Western countries over its invasion of Ukraine, Russia is considering accepting bitcoin as payment for its oil and gas exports.\nIn a videotaped news conference held on Thursday, the chair of Russia's Duma committee on energy said in translated remarks that when it comes to \"friendly\" countries such as China or Turkey, Russia is willing to be more flexible with payment options.\nChair Pavel Zavalny said that the national fiat currency of the buyer — as well as bitcoin — were being considered as alternative ways to pay for Russia's energy exports.\n\"We have been proposing to China for a long time to switch to settlements in national currencies for rubles and yuan,\" Zavalny said in translated comments. \"With Turkey, it will be lira and rubles.\"\nHe didn't stop with traditional currencies.\n\"You can also trade bitcoins,\" he said.\nBitcoin is up close to 4% over the last 24 hours to about $44,000. The price of the cryptocurrency spiked around the time that news reports of Zavalny's remarks first crossed.\nThe energy chair also doubled down on President Vladimir Putin's promise on Wednesday to require \"unfriendly” countries to pay for gas in Russian rubles. Putin's announcement sent European gas prices soaring over worries the move might aggravate an energy market already under pressure.\n\"If they want to buy, let them pay either in hard currency, and this is gold for us, or pay as it is convenient for us, this is the national currency,\" Zavalny said, in comments that echoed the president's warning from the day before\nThough the U.S. has banned imports of Russian oil as part of its response to Moscow's war on Ukraine, sources have said that it's unlikely that the European Union will follow suit, given its heavy dependence on Russian energy, in part to heat homes during the winter months.\n\"Russia is clearly looking to diversify into other currencies,\" said Nic Carter, co-founder of Coin Metrics. He said that Russia had been preparing for that kind of transition since 2014, when it started to divest all U.S. Treasurys.\n\"But the country wasn't fully prepared for foreign FX assets to be frozen,\" said Carter, who is also a founding partner of Castle Island Ventures, an early-stage firm focused on cryptocurrency.\nRussia now appears to be serious about moving away from the dollar.\n\"They have something the world needs,\" Carter said. \"Russia is the No. 1 exporter of natural gas globally.\"\nRussia could potentially convert energy reserves into hard assets that could be used outside the dollar system.\nPutin has changed his tune on bitcoin. In 2021, the Russian leader said that while he believed bitcoin had value, he wasn't convinced it could replace the U.S. dollar in settling oil trades. Now, the Kremlin's top brass is weighing it as a form of payment for major exports. It's unclear, however, whether bitcoin's relative lack of liquidity could support international trade transactions of that magnitude.", "url": "https://www.cnbc.com/2022/03/24/russia-might-take-bitcoin-as-payment-for-oil-and-gas-as-sanctions-rise.html?utm_source=ground.news&utm_medium=referral"}
