{"id": "4", "authors": ["Emma Colton"], "date_publish": "11/14/21", "description": "Tesla CEO Elon Musk hit back at Sen. Bernie Sanders with a devastating response to his demands that the wealthy “pay their fair share.\"", "filename": "https%3A%2F%2Fwww.foxbusiness.com%2Fpolitics%2Felon-musk-bernie-sanders-pay-fair-share-forget-still-alive%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["technology"], "source_domain": "www.foxbusiness.com", "leaning": 5, "title": "Elon Musk slams Bernie for demanding wealthy pay 'fair share’: 'You're still alive'", "maintext": "Tesla CEO Elon Musk brushed off Sen. Bernie Sanders's demands that the wealthy \"pay their fair share\" in his latest back-and-forth with the self-described democratic socialist.\n\"I keep forgetting that you’re still alive,\" Musk tweeted at Sanders Sunday morning.\nThe tweet came in response to Sanders saying on Twitter Saturday that, \"We must demand that the extremely wealthy pay their fair share. Period.\"\nMusk has a net worth of about $294 billion.\nBERNIE SANDERS DISSES ELON MUSK’S WEALTH, SPACE PLANS AS HE CALLS FOR ‘PROGRESSIVE’ TAXES\nSanders’ press office did not immediately respond to Fox News’ request for comment on Musk’s tweet.\nThe two have previously sparred over taxes on Twitter, included in March when Sanders said Musk should \"focus on Earth\" instead of space travel and figuring out \"a progressive tax system.\"\n\"We are in a moment in American history where two guys — Elon Musk and Jeff Bezos — own more wealth than the bottom 40% of people in this country. That level of greed and inequality is not only immoral. It is unsustainable,\" Sanders tweeted on March 18.\nAMAZON CEO JEFF BEZOS SNUBS BERNIE SANDERS' INVITE TO HEARING ON INCOME INEQUALITY\nMusk, who also owns the aerospace company SpaceX, tweeted a couple of days later that he is using his wealth to get humanity to explore space.\n\"I am accumulating resources to help make life multiplanetary & extend the light of consciousness to the stars,\" Musk tweeted on March 21.\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\"Space travel is an exciting idea, but right now we need to focus on Earth and create a progressive tax system so that children don't go hungry, people are not homeless and all Americans have healthcare. The level of inequality in America is obscene and a threat to our democracy,\" Sanders responded.", "url": "https://www.foxbusiness.com/politics/elon-musk-bernie-sanders-pay-fair-share-forget-still-alive?utm_source=ground.news&utm_medium=referral"}