{"id": 5, "authors": [], "date_publish": "03/22/2022", "description": "A Russian court took further action against Meta's Facebook and Instagram on Monday under the country's \"extremism\" law, banning the companies from doing", "filename": "https%3A%2F%2Fwww.nbcnews.com%2Ftech%2Ftech-news%2Frussian-court-bans-facebook-instagram-extremism-law-rcna20872%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["technology"], "source_domain": "www.nbcnews.com", "leaning": 2, "title": "Russian court bans Facebook and Instagram under ‘extremism’ law", "maintext": "A Russian court took further action against Meta's Facebook and Instagram on Monday under the country's \"extremism\" law, banning the companies from doing business in Russia but allowing Russian users to continue using WhatsApp.\nThe Russian state-owned media outlet TASS reported the court-ordered ban based on a decision from Russian Judge Olga Solopova of the Tverskoy Court of Moscow, which it said went into effect immediately. The court determined that individual Russians will not be held responsible for “extremism” by continuing to use Facebook and Instagram, TASS reported.\nThe order follows Russia's announcement March 4 that it would block access to Facebook and Twitter after Meta banned several state media accounts.\nMeta will now be prohibited from opening branches in Russia and from doing business in Russia, TASS said. The Russian prosecutor general’s office cited calls for violence against Russian citizens on Meta-owned platforms as a reason for the ban.\nOn March 10, Reuters reported that internal Facebook emails said Meta would allow users in some countries to call for violence against Russians and Russian soldiers in the context of the Ukraine invasion, which Reuters said marked a shift away from the platform's hate speech policy.\nA spokesperson for Meta declined to comment.\nThe ban is another step in Kremlin-led institutions efforts to fight back against U.S. social media platforms in the wake of the Ukraine invasion. Disinformation experts said that Russia's state-led campaigns to push false narratives around the invasion have ramped up since the conflict began in late February.\nMeta owns and operates social media platforms and communication apps including Facebook, Instagram and WhatsApp. TASS reported that WhatsApp will not be banned under the new decision.\nAnother Russian state media organization, Interfax, reported that a Meta representative was present at Russia’s hearings and argued that the country did not have judicial oversight over a foreign company.\nWhatsApp was one of the most popular apps in Russia in 2021, used by 65 percent of internet users in the country, according to data published by Insider Intelligence. Al-Jazeera reported in March that WhatsApp use in Russia outpaced that of Telegram, another messaging platform that Russian state media uses to publish official government communications.\nOn March 18, Russia’s official Telegram channel for the government’s telecommunications regulator posted that social media platforms like Facebook, Instagram and WhatsApp “have been subject to restrictions in many countries” as a result of “content filtering conditions.” The same Telegram channel has been used since the start of Russia’s invasion of Ukraine to condemn social media platforms’ actions taken against Russian content and Russian users.", "url": "https://www.nbcnews.com/tech/tech-news/russian-court-bans-facebook-instagram-extremism-law-rcna20872?utm_source=ground.news&utm_medium=referral"}
