{"id": 4, "authors": [], "date_publish": "04/28/2022", "description": "The major increase in US support would include $20bn in military assistance, plus economic aid.", "filename": "https%3A%2F%2Fwww.bbc.co.uk%2Fnews%2Fworld-us-canada-61260511%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.bbc.co.uk", "leaning": 3, "title": "Biden proposes $33bn to help Ukraine in war", "maintext": "President Biden is asking Congress for $33bn (£27bn) in military, economic and humanitarian assistance to support Ukraine - although he insisted that the US was not \"attacking Russia\".\nMr Biden said it was \"critical\" for US lawmakers to approve the deal, which he said would help Ukraine defend itself.\nThe proposal includes more than $20bn in military aid, $8.5bn in economic aid and $3bn in humanitarian aid.\n\"It's not cheap,\" Mr Biden said on Thursday.\n\"But caving to aggression is going to be more costly if we allow it to happen.\"\nAlthough the US has already announced help for Ukraine, the proposals are a significant ramping up of aid.\nPresident Biden said US military support to Ukraine has so far amounted to 10 anti-tank weapons for every tank that Russia has deployed to Ukraine.\nBut despite his strong rhetoric, he said the US was not attacking Russia. \"We are helping Ukraine defend itself against Russian aggression,\" he insisted.\nOn Thursday, a spokesperson for Russia's Foreign Ministry said Western military support for Ukraine threatens \"the security of the continent\".\nPresident Biden is asking Congress to authorise an enormous sum of money for Ukraine - more than twice as much as the US has already spent on providing military equipment and humanitarian aid.\nThe US president wants to show he is undeterred by vague threats about the possible use of nuclear weapons, and a warning from Vladimir Putin that there could be retaliatory strikes against countries that intervene in Ukraine.\nHe shrugged off those comments - saying they show the desperation Russia is feeling about their abject failure to do what they set out to do.\nExplaining to Americans why this money is needed - at a time when many are suffering from rising living costs - he said it was not cheap, but doing nothing was more costly.\nAn additional plan to allow US authorities to not just freeze but liquidate the assets of Russian oligarchs is bold - and it has raised concerns among civil liberties groups in America. But it is likely to gain bipartisan support in Congress.\nYet it will not begin to cover cost of the additional sums of money the White House wants to spend supporting Ukraine's war efforts.\nIn his speech on Thursday, Mr Biden also addressed concerns over a nuclear confrontation. On Wednesday, Russian Foreign Minister Sergei Lavrov warned of a \"serious\" risk of nuclear war over Ukraine which \"can't be underestimated\".\n\"No one should be making idle comments about the use of nuclear weapons,\" Mr Biden said.\nAdditionally, Mr Biden took aim at what he termed Russian \"gas blackmail\" to threaten European energy supplies. This week, Russia cut off gas supplies to Poland and Bulgaria.\n\"We will not let Russia intimidate or blackmail their way out of these sanctions,\" he said. \"We will not allow them to use their oil and gas to avoid consequences for their aggression.\"\nThe announcement of the new Ukraine package comes at a difficult time for the US economy.\nData released by the Bureau of Economic Analysis on Thursday shows that the US economy shrank in the first quarter of 2022, with gross domestic product declining 1.4% between January and March.\nBut the package is likely to be approved by lawmakers, said North America correspondent Anthony Zurcher.\n\"At a time when Biden is struggling to get congressional funding for his domestic priorities, Congress seems to have an unlimited willingness to bankroll military support for Ukraine,\" he said.\n\"$33bn is significant amount, but if the past is any guide it should be approved with relative ease - as long as Democrats don't try to attach unrelated spending provisions to the legislation.\"\nMr Biden's first funding request after the war began, which was approved by Congress last month, was less than $14bn.\nLast week, President Biden authorised a second $800m (£642m) military aid package in as many weeks, as well as $500m (£401m) in direct economic assistance.\nThe US has moved quickly to help Ukraine since the war began in late February. That includes:\nReleasing $3.7bn in total military and security assistance\nDeploying more than 100,000 troops to Nato member countries in Europe, and\nImposing economic sanctions, asset freezes and travel bans on hundreds of Russian oligarchs and politicians\nThe White House on Thursday also proposed making it easier for the US to seize and sell Russian oligarchs' assets, and transfer their proceeds to Ukraine.\nWestern allies, including European Union member states, have been working together since March to track down the assets of Russian elites, from artwork and real estate to helicopters and yachts.\nAccording to the White House, the US has now sanctioned and blocked vessels and aircraft worth over $1bn, while the EU has collectively frozen over $30bn.\nThursday's sanctions measures would allow the US to use the funds from confiscated assets \"to remediate harms of Russian aggression in Ukraine\".", "url": "https://www.bbc.co.uk/news/world-us-canada-61260511?utm_source=ground.news&utm_medium=referral"}