{
    "id": "3",
    "authors": [
        "Natasha Bertrand",
        "Barbara Starr",
        "Jeremy Herb"
    ],
    "date_publish": "02/02/2021",
    "description": "President Joe Biden has formally approved the deployment of 3,000 US troops to Poland, Germany and Romania, the Pentagon announced Wednesday, in a move to bolster NATO countries in Eastern Europe with tens of thousands of Russian troops amassed along Ukraine's border.",
    "filename": "https%3A%2F%2Fwww.cnn.com%2F2022%2F02%2F02%2Fpolitics%2Fus-troops-europe-russia%2Findex.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json",
    "image_url": null,
    "topic": [
        "politics"
    ],
    "source_domain": "www.cnn.com",
    "leaning": 1,
    "title": "US troops to deploy to Eastern Europe amid Ukraine crisis",
    "maintext": "President Joe Biden has formally approved the deployment of 3,000 US troops to Poland, Germany and Romania, the Pentagon announced Wednesday, in a move to bolster NATO countries in Eastern Europe with tens of thousands of Russian troops amassed along Ukraine's border.\nThe deployments to Eastern Europe are a show of support to NATO allies feeling threatened by Russia's military moves near Ukraine and the threat of an invasion, US officials said.\nPentagon press secretary John Kirby said the deployments included roughly 2,000 troops that would deploy from the United States to Poland and Germany. In addition, approximately 1,000 troops currently based in Germany were moving to Romania.\nKirby said that the moves, which would happen in the coming days, were not permanent and emphasized, \"These forces are not going to fight in Ukraine.\"\nThe move is the most significant sign to date that the US is preparing for the prospect of Russian President Vladimir Putin launching an invasion of Ukraine, as Russia has shown no signs of de-escalating after several rounds of diplomatic talks with the US and NATO.\nBiden signed off on the additional troops following a meeting on Tuesday morning at the White House with Defense Secretary Lloyd Austin and Joint Chiefs Chairman Gen. Mark Milley, an official said.\nBiden said that the decision was \"totally consistent\" with what the US has told Russia throughout discussions.\n\"It's totally consistent with what I told Putin in the beginning,\" Biden said in a brief exchange in the White House East Room. \"As long as he's acting aggressively, we're going to make sure we reassure our NATO allies and Eastern Europe we're there and Article V is a sacred obligation.\"\nAt the same time the US was preparing to send troops to Europe, the White House said Wednesday it was no longer describing a potential Russian invasion of Ukraine as \"imminent,\" suggesting the word sent an unintended message.\n\"I used that once. I think others have used that once. And then we stopped using it because I think it sent a message that we weren't intending to send, which was that we knew President Putin had made a decision,\" White House press secretary Jen Psaki said.\nLast week, Psaki said an invasion by Russian troops of Ukraine continued to be \"imminent,\" a description that drew anger in Kyiv. Ukrainian officials, including President Volodymyr Zelensky, disagreed, arguing the descriptions could cause panic and economic turmoil.\n",
    "url": "https://www.cnn.com/2022/02/02/politics/us-troops-europe-russia/index.html?utm_source=ground.news&utm_medium=referral"
}