{"id": 6, "authors": [], "date_publish": "04/28/2022", "description": "Users increase by about 14 million compared to previous quarter, social media company announces", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Ftech%2Felon-musk-twitter-takeover-revenue-b2067508.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["tech"], "source_domain": "www.independent.co.uk", "leaning": 2, "title": "Twitter revenue reaches $1.2bn and daily users increase to 229m amid Elon Musk takeover", "maintext": "Twitter’s revenue reached $1.2bn and daily users increased to 229 million amid Elon Musk’s takeover of the social media company.\nOn Thursday, Twitter posted its quarterly earnings – $513m – days after the company agreed to be sold to the billionaire.\nIn the three months to March of this year, revenue rose 16 per cent, reaching $1.2bn, compared to the same period last year.\nThe San Francisco-based company reported on Thursday that they had an average of 229 million daily active users in that quarter – about 14 million more compared to the preceding quarter.\nThe agreement to sell the company to Mr Musk for $44bn was announced earlier this week and the deal is expected to be closed later this year.\nAs the company is in the process of being sold to the SpaceX and Tesla CEO, Twitter cancelled a conference call with executives and industry analysts that usually occurs when the results are presented.\n“Given the pending acquisition of Twitter by Elon Musk, we will not be providing any forward looking guidance, and are withdrawing all previously provided goals and outlook,” the company said.\nBefore the deal is completed, shareholders will give their views on the acquisition, as will regulators in the US and in countries where Twitter conducts business.\nDespite pushback from some of Twitter’s employees and the fears of some users concerning what Mr Musk’s free speech views might mean for harassment, hate speech, and misinformation on the platform, few obstacles are expected to appear for the deal to go through.\nMr Musk has said that he plans to take Twitter private, which would mean that the company would no longer have to answer to shareholders or publicly report its financial results, which have been mixed at best since the company went public in 2013.\nTwitter has struggled to find profitability as a public company while producing mediocre revenue growth compared to digital advertising giants Google and Facebook.\nBecoming a private company could give Twitter more space to experiment while concentrating less on short-term profit and its stock price. But Mr Musk, the world’s richest man, is also likely to want the company to be profitable.\n“I think there is nothing better for Twitter than Elon Musk buying it and ideally replacing the board, and also doubling down on investments into products and new revenue-generating sources,” technology entrepreneur and investor John Meyer said earlier this week.", "url": "https://www.independent.co.uk/tech/elon-musk-twitter-takeover-revenue-b2067508.html?utm_source=ground.news&utm_medium=referral"}