{"id": 3, "authors": ["Adam Carlson", "March"], "date_publish": "03/23/2022", "description": "Her family remembered her as a \"tireless champion of democracy and human rights\" and a \"loving mother, grandmother, sister, aunt, and friend\"", "filename": "https%3A%2F%2Fpeople.com%2Fpolitics%2Fmadeleine-albright-historic-secretary-of-state-dies-of-cancer%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "people.com", "leaning": 1, "title": "Madeleine Albright Dead from Cancer: Former Secretary of State Was 84", "maintext": "Madeleine Albright, the first female U.S. secretary of state and for a time the country's highest-ranking woman, has died. She was 84.\nAlbright's death on Wednesday was announced later that day by her family, who remembered her as a \"tireless champion of democracy and human rights\" and a \"loving mother, grandmother, sister, aunt, and friend.\"\nGet push notifications with news, features and more.\nShe died of cancer and had been \"surrounded by family and friends,\" according to the statement.\nA childhood refugee from Prague, in what was then Czechoslovakia, Albright immigrated to the United States as a girl in 1948, at 11 years old.\n\"Becoming a U.S. citizen is the most important thing that ever happened to me,\" she later said, remembering how her father would remark that \"in Europe during [World War II] people would say, 'We are sorry for your troubles and hope that you have everything you need; by the way, when will you be leaving to go back home?' But in America, people said: 'We are sorry for your troubles and hope that you have everything you need; by the way, when will you become a citizen?' \"\nAfter coming to the U.S., Albright spent the remainder of her childhood in Denver, going on to study at Wellesley College, where she graduated in 1959.\nAfter years of postgraduate study, she was eventually recruited to the White House under President Jimmy Carter where a former teacher, Zbigniew Brzezinski, was the national security adviser. Albright counseled a number of prominent Democratic politicians on foreign policy and was named as President Bill Clinton's ambassador to the United Nations in 1993.\nClinton nominated her as the first female secretary of state in December 1996 and she was unanimously confirmed weeks later, in early 1997. She remained in that role until the end of Clinton's second term as president.\nIn later decades, Albright taught at Georgetown University and was the head of her own consulting firm, among other roles. She wrote a number of books and continued to speak out about current events and to make public appearances (including a cameo in NBC's Parks and Recreation, in 2015, and a 2018 appearance with friend and fellow former Secretary of State Hillary Clinton on CBS' Madame Secretary).\nShe was awarded the Presidential Medal of Freedom, the country's highest civilian honor, by then-President Barack Obama in 2012.\nIn a 2020 interview, she again called on the world to work together on what she saw as urgent problems: \"We are in one of the most crucial periods that I've ever seen — and I'm old and I've seen a lot of very serious problems, like World War II and communism taking over. I don't think we're going to go back to something. We need to develop a system that is able to deal with the fact that there's been a breakdown in the social contract. ... I would make sure we talk to people with whom we disagree and try to understand where they're coming from, not just tolerate them, but figure out what is motivating them.\"\nAs secretary of state, Albright was known for her shrewdness, her direct and personable approach to diplomacy — \"Everybody has their own style, and mine is people to people,\" she once said, according to the Times — and, yes, her famed collection of brooches and pins.\nIn a 2009 interview, she said she had hundreds of them. World leaders had taken note, she said. For example, \"President [Vladimir] Putin made clear to President Clinton that he knew to look at what pins I had on.\"\n\"In terms of sentimental favorites is the heart my daughter made for me when she was 5, which I try to wear every Valentine's Day,\" Albright said then. \"But,\" she continued, \"I think the pin that in many ways is so meaningful is the eagle pin, the one I call the 'secretary pin,' \" featuring an American eagle. It was the one she wore as she was sworn in in 1997.\n\"That probably is my favorite pin because of everything it symbolizes,\" she said.\nAs America's top diplomat in the late '90s, Albright supported the expansion of NATO, the American-European alliance of countries designed to counter the Soviet Union.\n\"As secretary, I will do my best to talk about foreign policy not in abstract terms, but in human terms and bipartisan terms,\" she said in remarks in Texas, shortly after being confirmed, according to The New York Times. \"I consider this vital because in our democracy, we cannot pursue policies abroad that are not understood and supported here at home.\"\nAlbright also worked with Clinton on weighing the U.S.' role in several major crises, such as the Rwandan genocide. She later said America's reluctance to intervene was her \"deepest regret from my years in public service.\"\nShe periodically addressed other mistakes in her thinking about world affairs, including how she had underestimated Russia's post-Cold War ambitions, she said.\nShe also grappled with the revelation, as an adult, that her parents had essentially fabricated much of her family's backstory as part of their escape from the Nazis in Europe and a later communist coup in their home country.\nFor decades Albright believed she was Roman Catholic. In fact, her family was Jewish and dozens of relatives were killed in the Holocaust.She is survived by her three daughters, according to the Times. She divorced Joseph Medill Patterson Albright, a newspaper scion, in the '80s.", "url": "https://people.com/politics/madeleine-albright-historic-secretary-of-state-dies-of-cancer/?utm_source=ground.news&utm_medium=referral"}