{"id": 3, "authors": [], "date_publish": "03/25/2022", "description": "Deal to replace Russian supply announced at EU summit on Friday", "filename": "https%3A%2F%2Fwww.independent.co.uk%2Fnews%2Fworld%2Fpolitics%2Frussia-gas-eu-joe-biden-b2043859.html%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.independent.co.uk", "leaning": 2, "title": "Joe Biden agrees to boost US gas supplies to Europe to reduce dependence on Russia", "maintext": "The United States has agreed to step up gas exports to the European Union in a bid to reduce reliance eon Russian supplies\nUnder a deal announce on Friday Joe Biden promised the US would deliver at least 15 billion cubic metres (bcm) more liquid natural gas to Europe than under previous plans.\nThe accord was struck by Mr Biden and EU leaders at a summit in Brussels on Friday, which the US president is attending.\nThe arrangement also sees the US commit to increase gas supplies in 2023.\n“We aim to reduce this dependency on Russian fossil fuels and get rid of it. This can only be achieved through... additional gas supplies, including LNG deliveries”, Ms von der Leyen said at a joint press conference with Mr Biden on Friday in the Belgian capital.\n“We as Europeans want to diversify away from Russia towards suppliers that we trust, that are our friends, that are reliable.\n“Therefore, the US commitment to provide the European Union with additional at least 15 billion cubic metres of LNG this year is a big step in this direction because this will replace the LNG supply we currently receive from Russia.”\nThe US president told the same group of journalists: “We’re coming together to reduce Europe’s dependence on Russia’s energy. We should not subsidise Putin’s brutal attack on Ukraine.”\nGas prices have surged to record levels in the wake of Russia's invasion of Ukraine, and some countries like Germany and Italy are heavily reliant on Russian supply.\nGermany's government has already pulled the plug on a planned gas pipeline called Nordstream 2 which critics said would increase reliance on supply controlled by Vladimir Putin's regime.\nBut Russia currently supplies 40 per cent of the EU’s gas needs and 25 per cent of its oil, albeit with significant differences between countries. Boris Johnson conceded on Thursday at a Nato summit that it was easier for some countries to quit Russian hydrocarbons than others.\nEU leaders are on Friday discussing whether to impose phased-in restrictions on the purchase of Russian fossil fuels such as oil and coal – but gas is not expected to be on the table.\nAlexander de Croo, the Belgian prime minister, told reporters on the doorstep of the summit: \"Measures on energy right now would have a huge impact on our economies.\n“The basic rule is that sanctions must have a much greater impact on the Russian side than on the European side. We don't wage war on ourselves.\"\nMeanwhile Mark Rutte, the Dutch leader said: “Everybody wants it but it’s nothing that you can do in the short term.\"\nUS liquid natural gas plants are thought to be producing at full capacity and the exports will likely come from supply previously destined for other parts of the world.\nAnalysts at Goldman Sachs said \"near-term measures\" to support European LNG imports would \"rely on the reallocation of existing supply\".\nThey added that “such a relocation to Europe is already happening” because EU gas prices have in recent months generally been the highest in the world.", "url": "https://www.independent.co.uk/news/world/politics/russia-gas-eu-joe-biden-b2043859.html?utm_source=ground.news&utm_medium=referral"}
