{"id": 7, "authors": [], "date_publish": "03/22/2022", "description": "The British-Iranian was speaking publicly for the first time since her release from Iran last week.", "filename": "https%3A%2F%2Fwww.bbc.com%2Fnews%2Fuk-60819018%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.bbc.com", "leaning": 3, "title": "Nazanin Zaghari-Ratcliffe: I should have been freed six years ago", "maintext": "Nazanin Zaghari-Ratcliffe has said it should never have taken the government so long to secure her release from prison in Iran.\nShe told a news conference she had been overwhelmed with emotion to be reunited with her husband and daughter, describing the reunion as precious.\nBut she said \"what's happened now should have happened six years ago\".\nThe British-Iranian was speaking for the first time since her dramatic return to the UK last week.\nMrs Zaghari-Ratcliffe was arrested on spying charges while visiting her parents in Iran, with her then two-year-old daughter Gabriella, in April 2016. Last week, she was freed after spending six years in detention.\nHer release came after the UK government paid a £400m debt to Iran dating back to the 1970s, although both governments have said the two issues should not be linked.\nSpeaking to the media in Westminster, Mrs Zaghari-Ratcliffe thanked all those who had worked to get her released, paying tribute to her \"amazing, wonderful\" husband, Richard Ratcliffe, who she said had campaigned tirelessly. She also thanked her daughter \"for being very, very patient with mummy\".\nBut she took issue with the credit her husband had granted Foreign Secretary Liz Truss for her release, saying: \"I have seen five foreign secretaries change over the course of six years. How many foreign secretaries does it take for someone to come home?\"\nShe added: \"We all know… how I came home. It should have happened exactly six years ago.\"\nDescribing her arrival back in the UK, Mrs Zaghari-Ratcliffe recalled the \"precious\" and \"glorious\" feeling of stepping off the plane and seeing her daughter again.\n\"I had been waiting for that moment for such a long time,\" she said.\n\"It was lovely to get to hold her, to braid her hair and to brush her hair. That was a moment that I really, really missed.\"\nShe said she was looking forward to getting to know Gabriella better again and doing everyday things like taking her to school.\nAlso speaking at the news conference, Mr Ratcliffe joked that it was \"nice to be retiring\" from his role as a campaigner, and thanked everyone for \"making us whole again\".\n\"I'm so pleased she's back home, that she came home to us. We're still negotiating whether daddy's allowed in the same bed as Gabriella and Nazanin. We'll get there.\"\nMr Ratcliffe continued: \"I think we'll do this and then we will disappear off and heal a bit.\"\nMrs Zaghari-Ratcliffe declined to speak about her ordeal, saying it would always haunt her.\nBut she added: \"I always felt like I was holding this black hole in my heart all these years. I am going to leave that black hole on the plane.\"\nWhile in Iran in September 2016, Mrs Zaghari-Ratcliffe, a project manager for the Thomson Reuters Foundation, was accused of plotting to overthrow the Iranian government and was given a five-year sentence.\nThen, in April 2021, she was sentenced for another year on charges of propaganda against the government.\nMrs Zaghari-Ratcliffe has always denied those allegations and said that she was only in Iran to visit her family.\nSpeaking on Monday, she said she had been told by Iranian authorities shortly after her arrest that they wanted \"something off the Brits\", and that they would not let her go until they had got it.\n\"And they did keep their promise,\" she said.\nEarlier during her visit to Westminster, Mrs Zaghari-Ratcliffe met Speaker of the House Sir Lindsay Hoyle in his parliamentary rooms.\nThe Speaker told her \"the whole nation rejoiced\" when she returned to the UK.\nHe added: \"You have achieved something that many others before you have not - in uniting the House in their efforts and hope to get you home.\"\nAnother British-Iranian national, Anoosheh Ashoori, was released at the same time as Mrs Zaghari-Ratcliffe.\nBut Mrs Zaghari-Ratcliffe also used the event to draw attention to the plight of other dual nationals still detained in Iran.", "url": "https://www.bbc.com/news/uk-60819018?utm_source=ground.news&utm_medium=referral"}