{"id": 3, "authors": ["Jessica Elgot", "Rowena Mason"], "date_publish": "03/22/2022", "description": "News comes after questionnaires were sent to more than 100 people thought to be involved in lockdown gatherings", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2022%2Fmar%2F21%2Fdowning-street-parties-met-police-begin-interviewing-witnesses%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.theguardian.com", "leaning": 2, "title": "Downing Street parties: Met police begin interviewing witnesses", "maintext": "Boris Johnson is facing a possible police interview over lockdown breaches in Downing Street as the Metropolitan police said they intended to start questioning witnesses after sending out questionnaires to more than 100 people.\nBut the police statement – issued two months since inquiries began – suggests officers have not yet found breaches that meet the evidentiary threshold for fixed-penalty notices to be issued without further interviews. No FPNs have been issued so far, the force said.\nThe update suggests the investigation may be some way off being concluded. The Met said it “involves a significant amount of investigative material; the serving of over 100 questionnaires and the need to individually assess every response”.\nIt added: “The offences under consideration comprise a number of elements and the legislation itself changed between the event dates. We are progressing the investigation as quickly as possible.\n“As yet, we have not made any referrals to the Acro criminal records office for the issuing of fixed-penalty notices. However, every questionnaire response is being assessed alongside all available evidence, and should this reach the evidential threshold, then referrals will be made.”\nAllies of the prime minister are publicly expressing confidence that he will not be issued with a penalty by police. Oliver Dowden, the Tory co-chair, told LBC: “The prime minister is actually absolutely resolutely clear that he is not going to be subject to a fixed-penalty notice because he is confident that he has not broken the law.”\nThe announcement that the Met were now seeking interviews with those involved prompted incredulity from senior sources. “The police have had all the evidence they need that rules were broken for months,” one said.\nIt comes two months after police began examining material from the Whitehall inquiry by the senior civil servant Sue Gray meaning it is now unlikely a verdict on Johnson will be reached before the May local elections.\nScotland Yard obtained more than 300 photographs and 500 pages of documents showing what Gray’s inquiry believes to be potential rule-breaking. Images include photos taken at parties and those taken from security-system cameras showing when people entered and exited buildings.\nOne former Whitehall source pointed out detectives also have access to security pass data, showing who entered and exited the building, as well as screenshots of WhatsApp messages about parties. “They have more than enough,” the source said.\nA significant number of Conservative MPs had said they would not move to trigger a vote of no confidence in the prime minister until after the police had determined whether his attendance at multiple parties over the lockdown period was a breach of the law.\nJohnson has emphasised he believed the gatherings he attended were work events – including one where his former principal private secretary invited attendees for summer drinks in the garden and told them to bring their own alcoholic drinks. It is understood Johnson has not yet been called for an interview.\nSince Russia’s invasion of Ukraine, however, at least two Conservative MPs – Douglas Ross and Andrew Bridgen – have withdrawn letters of no confidence in Johnson, saying it was not the time for a leadership contest.\nA number of senior Conservatives who have suggested they would move against the PM should the police issue a fine have now also suggested they believe a no-confidence challenge would be misplaced.\nOther critics of the prime minister within the parties say they remain convinced that a vote of no confidence will be triggered should he be found to have breached the law.", "url": "https://www.theguardian.com/world/2022/mar/21/downing-street-parties-met-police-begin-interviewing-witnesses?utm_source=ground.news&utm_medium=referral"}