{"id": 0, "authors": [], "date_publish": "04/28/2022", "description": "Moderna submits data to FDA, in hopes low-dose shots to protect babies, toddlers and preschoolers will be available by summer", "filename": "https%3A%2F%2Fwww.theguardian.com%2Fworld%2F2022%2Fapr%2F28%2Fmoderna-asks-us-authorize-covid-19-vaccine-children-under-age-six%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.theguardian.com", "leaning": 2, "title": "Moderna asks US to authorize Covid-19 vaccine for children under age six", "maintext": "Moderna on Thursday asked US regulators to authorize low doses of its Covid-19 vaccine for children younger than six, a long-awaited move toward potentially making injections available for millions of children by summer.\nFrustrated families are waiting impatiently for a chance to protect the nation’s youngest kids as all around them people shed masks and other public health precautions – even though highly contagious coronavirus mutants continue to spread.\nModerna submitted data to the Food and Drug Administration that it hopes will prove two low-dose shots can protect babies, toddlers and preschoolers – albeit not as effectively during the Omicron surge as earlier in the pandemic.\n“There is an important unmet medical need here with these youngest kids,” said Dr Paul Burton, Moderna’s chief medical officer, to the Associated Press. Two kid-size shots “will safely protect them. I think it is likely that over time they will need additional doses. But we’re working on that”.\nNow, only children ages five or older can be vaccinated in the US, using rival Pfizer’s vaccine, leaving 18 million younger children unprotected.\nModerna’s vaccine isn’t the only one in the race. Pfizer is soon expected to announce if three of its even smaller-dose shots work for the littlest children, months after the disappointing discovery that two doses weren’t quite strong enough.\nWhether it’s one company’s shots or both, FDA vaccine chief Dr Peter Marks said the agency will “move quickly without sacrificing our standards” in deciding if child-sized doses are safe and effective.\nWhile questions are swirling about what’s taking so long, Marks pointedly told lawmakers this week that the FDA can’t evaluate a product until a manufacturer completes its application. FDA will publicly debate the evidence with its scientific advisers before making a decision, and Marks said multiple meetings would be scheduled to cover several expected applications.\n“It’s critically important that we have the proper evaluation so that parents will have trust in any vaccines that we authorize,” Marks told a Senate committee.\nIf FDA clears vaccinations for the littlest, next the Centers for Disease Control and Prevention would have to recommend who needs them – all children or just those at higher risk from Covid-19.\nMany parents are desperate for whichever vaccine gets to the scientific finish line first.\n“We’ve been kind of left behind as everybody else moves on,” said Meagan Dunphy-Daly, a Duke University marine biologist whose six-year-old daughter is vaccinated – but whose three-year-old and 18-month-old sons are part of Pfizer’s trial.\nThe FDA will face some complex questions.\nIn a study of kids ages six months through five years, two Moderna shots – each a quarter of the regular dose – triggered high levels of virus-fighting antibodies, the same amount proven to protect young adults, Burton of Moderna said. There were no serious side effects, and the shots triggered fewer fevers than other routine vaccinations.\nBut the vaccine proved between about 40% and 50% effective at preventing symptomatic Covid-19 during the trial. Burton blamed the Omicron variant’s ability to partially evade vaccine immunity, noting that unboosted adults showed similarly less effectiveness against milder Omicron infections. While no children became severely ill during the study, he said high antibody levels are a proxy for protection against more serious illness – and the company will test a child booster dose.\nAnother problem: so far in the US, Moderna’s vaccine is restricted to adults. Other countries have expanded the shot to kids as young as six. But months ago the FDA cited concern about a rare side effect, heart inflammation, in teen boys, and it hasn’t ruled on Moderna’s earlier pediatric applications.\nBurton said the FDA may consider its vaccine for children of all ages – but also might open it first to the youngest kids who have no other option. He said safety data from millions of older children given Moderna vaccinations abroad should help reassure parents.\nWhile Covid-19 generally isn’t as dangerous in children as adults, some do become severely ill or even die. About 475 children younger than five have died from Covid-19 since the pandemic’s start, according to the CDC, and child hospitalizations soared at Omicron’s peak.\nYet it’s not clear how many parents intend to vaccinate the youngest kids. Less than a third of children ages five to 11 have had two vaccinations, and 58% of those ages 12 to 17.", "url": "https://www.theguardian.com/world/2022/apr/28/moderna-asks-us-authorize-covid-19-vaccine-children-under-age-six?utm_source=ground.news&utm_medium=referral"}