{"id": 1, "authors": ["Ayana Archie"], "date_publish": "03/23/2022", "description": "No deaths were reported in tests, and there were no signs of myocarditis, or heart inflammation, as a side effect.", "filename": "https%3A%2F%2Fwww.npr.org%2F2022%2F03%2F23%2F1088167753%2Fmoderna-covid-19-vaccine-children-fda%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["coronavirus"], "source_domain": "www.npr.org", "leaning": 3, "title": "Moderna wants the FDA to authorize its COVID-19 vaccine for kids under 6", "maintext": "Moderna wants the FDA to authorize its COVID-19 vaccine for kids under 6\nEnlarge this image toggle caption Michael Minasi/KUT Michael Minasi/KUT\nModerna is hoping to get the green light to administer a pediatric, low-dose COVID-19 vaccine for children ages 6 months to under 6 years of age, it said in a statement.\nThe pharmaceutical company will submit a request to the Food and Drug Administration \"in the coming weeks\" for authorization for a two-dose, 25 microgram-each shot. That's 25% of the first two doses adults received, the company said.\n\"Given the need for a vaccine against COVID-19 in infants and young children, we are working with the U.S. FDA and regulators globally to submit these data as soon as possible,\" Moderna CEO Stéphane Bancel said in the statement.\nIn tests, the doses were given 28 days apart to 2,500 children ages 6 months to under 2 and to 4,200 children ages 2 to under 6.\nThe pediatric doses \"showed a robust neutralizing antibody response\" similar to adults' doses, with \"a favorable safety profile,\" the company said.\nThough, the efficacy was 43.7% in children 6 months to 2 years old, and 37.5% in children from 2 to under 6. No severe cases of COVID-19 were reported.\nDr. Jesse Goodman, a professor of medicine and infectious diseases at Georgetown University, said the study, while promising, leaves many questions unanswered, such as how long the children were observed after being vaccinated and whether efficacy rates could decline over time.\n\"No severe disease was seen in the study,\" he said, \"so it is unclear whether protection against severe disease, which is most important, may be greater than the protection against milder infections, as has been generally seen in adults.\"\nFive is the youngest age at which the COVID-19 vaccine is currently available. Children from ages 5 to 11 are eligible for Pfizer's pediatric vaccine, though research shows efficacy rates in children dropped significantly after about seven weeks.\nModerna said, \"The majority of adverse events were mild or moderate and were more frequently reported after dose two.\"\n17% of children from 6 months to under 2 years old had fevers of 100.4 degrees, while 14.6% of children from 2 to under 6 had the same side effect. These results are \"consistent with other commonly used and recommended pediatric vaccines,\" the release said.\nNo deaths were reported, and there were no signs of myocarditis, or heart inflammation, as a side effect. (Myocarditis has been seen rarely after vaccination with both Pfizer and Moderna's COVID vaccines.)\nDr. Saad Omer, the director of the Yale Institute for Global Health, said, \"Given the evidence from the other age groups, the protection against severe disease and hospitalization should be higher,\" while advising a booster shot be considered. Moderna said it is planning to submit its vaccine for children ages 6 to 11 for emergency authorization use, while also currently testing a booster dose for children from 6 months to 11 years of age.\nRob Stein said the FDA usually convenes outside advisers to review data and make a recommendation about whether to authorize a vaccine, but it's not an ironclad requirement. Then the Centers for Disease Control and Prevention would weigh in, which can happen very quickly.", "url": "https://www.npr.org/2022/03/23/1088167753/moderna-covid-19-vaccine-children-fda?utm_source=ground.news&utm_medium=referral"}