{"id": 5, "authors": [ "Jeff Mordock", "Ramsey Touchberry"], "date_publish": "03/25/2022", "description": "U.S. President Biden and European Commission President Ursula von der Leyen announced a deal Friday to reduce Europe's dependence on Russian oil and gas.", "filename": "https%3A%2F%2Fwww.washingtontimes.com%2Fnews%2F2022%2Fmar%2F25%2Fus-eu-announce-new-partnership-to-undercut-russian%2F%3Futm_source%3Dground.news%26utm_medium%3Dreferral.json", "image_url": null, "topic": ["politics"], "source_domain": "www.washingtontimes.com", "leaning": 4, "title": "U.S., EU announce new partnership to undercut Russian energy", "maintext": "U.S. President Biden and European Commission President Ursula von der Leyen announced a deal Friday to reduce Europe’s dependence on Russian oil and gas.\nAs part of the plan, the European Union and the U.S. will form a joint task force aimed at weaning Europe off Russian energy and finding alternatives to liquefied natural gas. The U.S. will also supply Europe with at least 15 billion cubic meters of liquified natural gas.\nIn addition, the task force will work toward reducing green gas emissions by paring down methane emissions and using clean energy. The task force will be co-chaired by a representative of the White House and a representative from the EU.\nThe steps announced Friday will help the EU phase out Russian oil and natural gas by the end of the decade.\nThe EU imports roughly 90% of its total natural gas with 40% coming from Russia, making it difficult to completely ditch Russian energy. The U.S. has become the largest LNG exporter in the world over the last three months thanks to new exports to the EU, a major win for the U.S. LNG industry.\n“These steps will increase energy security, economic security and national security,” Mr. Biden said during a joint press statement with Ms. von der Leyen in Brussels, Belgium.\n“It’s not only the right thing to do from a moral standpoint, it’s going to put us on a much stronger strategic footing,” Mr. Biden continued.\nMs. von der Leen said the agreement will move the European Union’s energy reliance away from Russia and toward “our friends and partners who are trustworthy suppliers.”\n“We need to secure our supplies not just for next winter but also for the years ahead, and this is an important and big starting point to do that,” she said.\nThe threat of Moscow using its dominance of the energy market as leverage against Europe has long been a concern, but Russian President Vladimir Putin’s war on Ukraine has propelled the issue to the forefront of U.S.-EU relations.\nEuropean leaders are banking on the U.S. to help them significantly reduce the continent’s dependency on Russian energy with increased shipments of liquefied natural gas from America.\nThe EU wants the U.S. to play a large role in helping the 27-nation coalition, where energy prices are far higher than in America, ban together to stow away at least 80% capacity in their natural gas storage facilities in a concerted effort to prepare for the next winter.\nIt’s also a win for former President Donald Trump. While in office, he advocated for making U.S. LNG a viable alternative to Russian energy in Europe, though cheaper Russian natural gas made the plan impractical. The Russia-Ukraine war and spiking energy prices have changed that.\nStill, the request for a sharp increase in new LNG will be a tall order for the Biden administration to fill anytime soon.\nThe government has limited control over a private LNG industry that analysts say is already at full capacity. Also, ramping up new drilling or export permits would take years to have an impact.\n“It’s important to be realistic about what can be done in the near time,” said Dustin Meyer, vice president of natural gas markets for the lobbying firm American Petroleum Institute. “Expansions are possible in the coming years, but newer significant capacity will take a couple of years to come online.”\nEurope has a lot of work to do to get away from Russian energy entirely, which it has pledged to do by 2027. It will require a fundamental reshaping of the way the continent gets its energy.\nMr. Biden also would have to commit to helping the U.S. LNG industry increase production, which is what the gas industry wants to see.\nThat stance, however, would run contrary to Mr. Biden’s climate agenda. Doing so would increase confidence among companies that expensive investments now will pay off in the future.\nA “clear and consistent” permitting process for LNG exports is also vital, Mr. Meyer said, which he said had been lacking until recently.\nThe Department of Energy approved two long-awaited LNG exporting permits last week. Four additional permits remain on the back burner, which if approved could increase LNG exports by 20%, according to the American Exploration and Production Council that advises oil and natural gas companies.\nIt would take anywhere from months to years for a full-scale increase once approved.\nRepublicans have for years tried to expand LNG exports to Europe, with a renewed push amid the Russia-Ukraine war. Mr. Trump also sought to increase exports to undercut Russia’s influence. LNG exports during the Trump administration increased roughly six-fold during his tenure, according to the Energy Information Administration.\n“The administration needs to start leading from the front,” said Sen. John Barrasso of Wyoming, the ranking Republican on the Energy Committee. “Our allies in Europe realize what a terrible mistake it was to rely on your enemies for your energy, and they realize energy security is much more important than climate zealotry.”\nMr. Biden, congressional Democrats and EU leaders remain wary of the climate impact from LNG. The White House shelved a potential review for how the U.S. could ramp up how much it sends to Europe due to environmental concerns, Reuters reported this month.\nDemocrats have echoed similar greenhouse gas emissions concerns associated with natural gas, in addition to placing the onus on private energy companies rather than the federal government to boost production.\n“We should, frankly, be all getting off of oil and fossil fuels, and this is yet another lesson or message that we need to do that,” said Sen. Mazie Hirono, Hawaii Democrat and member of the Senate Energy Committee. “I’m concerned that this could turn into a license for the fossil fuel guys to just keep drilling and continue our reliance on fossil fuels.”\n•", "url": "https://www.washingtontimes.com/news/2022/mar/25/us-eu-announce-new-partnership-to-undercut-russian/?utm_source=ground.news&utm_medium=referral"}